Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2fc9 (32-bit)
   Version:       4
   Abbrev Offset: 0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xcee): GNU C++ 5.4.0 20160609 -mtune=generic -march=x86-64 -g -fPIC -fvisibility-inlines-hidden -fstack-protector-strong
    <10>   DW_AT_language    : 4	(C++)
    <11>   DW_AT_name        : (indirect string, offset: 0xed3): /root/gl/skf_wrapper/skf_wrapper.cpp
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xcd9): /root/gl/skf_wrapper
    <19>   DW_AT_low_pc      : 0x78a0
    <21>   DW_AT_high_pc     : 0x3239
    <29>   DW_AT_stmt_list   : 0
 <1><2d>: Abbrev Number: 2 (DW_TAG_namespace)
    <2e>   DW_AT_name        : std
    <32>   DW_AT_decl_file   : 19
    <33>   DW_AT_decl_line   : 0
    <34>   DW_AT_sibling     : <0x88f>
 <2><38>: Abbrev Number: 3 (DW_TAG_namespace)
    <39>   DW_AT_name        : (indirect string, offset: 0x1bef): __cxx11
    <3d>   DW_AT_decl_file   : 4
    <3e>   DW_AT_decl_line   : 218
 <2><3f>: Abbrev Number: 4 (DW_TAG_imported_module)
    <40>   DW_AT_decl_file   : 4
    <41>   DW_AT_decl_line   : 218
    <42>   DW_AT_import      : <0x38>	[Abbrev Number: 3 (DW_TAG_namespace)]
 <2><46>: Abbrev Number: 5 (DW_TAG_imported_declaration)
    <47>   DW_AT_decl_file   : 3
    <48>   DW_AT_decl_line   : 64
    <49>   DW_AT_import      : <0xc82>	[Abbrev Number: 8 (DW_TAG_typedef)]

    <944>   DW_AT_name        : (indirect string, offset: 0xadf): __digits
    <948>   DW_AT_decl_file   : 16
    <949>   DW_AT_decl_line   : 64
    <94a>   DW_AT_type        : <0xc94>
    <94e>   DW_AT_external    : 1
    <94e>   DW_AT_declaration : 1
 <3><94e>: Abbrev Number: 32 (DW_TAG_template_type_param)
    <94f>   DW_AT_name        : (indirect string, offset: 0xec): _Value
    <953>   DW_AT_type        : <0xc02>
 <3><957>: Abbrev Number: 0
 <2><958>: Abbrev Number: 7 (DW_TAG_structure_type)
    <959>   DW_AT_name        : (indirect string, offset: 0x1267): __numeric_traits_integer<char>
    <95d>   DW_AT_byte_size   : 1
    <95e>   DW_AT_decl_file   : 16
    <95f>   DW_AT_decl_line   : 55
    <960>   DW_AT_sibling     : <0x99a>
 <3><964>: Abbrev Number: 37 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x1522): __min
    <969>   DW_AT_decl_file   : 16
    <96a>   DW_AT_decl_line   : 58
    <96b>   DW_AT_type        : <0xc9f>
    <96f>   DW_AT_external    : 1
    <96f>   DW_AT_declaration : 1
 <3><96f>: Abbrev Number: 37 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x1131): __max
    <974>   DW_AT_decl_file   : 16
    <975>   DW_AT_decl_line   : 59
    <976>   DW_AT_type        : <0xc9f>
    <97a>   DW_AT_external    : 1
    <97a>   DW_AT_declaration : 1
 <3><97a>: Abbrev Number: 37 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x1bd8): __is_signed
    <97f>   DW_AT_decl_file   : 16
    <980>   DW_AT_decl_line   : 63
    <981>   DW_AT_type        : <0x1635>
    <985>   DW_AT_external    : 1
    <985>   DW_AT_declaration : 1
 <3><985>: Abbrev Number: 37 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0xadf): __digits
    <98a>   DW_AT_decl_file   : 16
    <98b>   DW_AT_decl_line   : 64
    <98c>   DW_AT_type        : <0xc94>
    <990>   DW_AT_external    : 1
    <990>   DW_AT_declaration : 1
 <3><990>: Abbrev Number: 32 (DW_TAG_template_type_param)
    <991>   DW_AT_name        : (indirect string, offset: 0xec): _Value
    <995>   DW_AT_type        : <0xc69>
 <3><999>: Abbrev Number: 0
 <2><99a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <99b>   DW_AT_name        : (indirect string, offset: 0xdb8): __numeric_traits_integer<short int>
    <99f>   DW_AT_byte_size   : 1
    <9a0>   DW_AT_decl_file   : 16
    <9a1>   DW_AT_decl_line   : 55
    <9a2>   DW_AT_sibling     : <0x9dc>
 <3><9a6>: Abbrev Number: 37 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x1522): __min
    <9ab>   DW_AT_decl_file   : 16
    <9ac>   DW_AT_decl_line   : 58
    <9ad>   DW_AT_type        : <0x16da>
    <9b1>   DW_AT_external    : 1
    <9b1>   DW_AT_declaration : 1
 <3><9b1>: Abbrev Number: 37 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x1131): __max
    <9b6>   DW_AT_decl_file   : 16
    <9b7>   DW_AT_decl_line   : 59
    <9b8>   DW_AT_type        : <0x16da>
    <9bc>   DW_AT_external    : 1
    <9bc>   DW_AT_declaration : 1
 <3><9bc>: Abbrev Number: 37 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x1bd8): __is_signed
    <9c1>   DW_AT_decl_file   : 16
    <9c2>   DW_AT_decl_line   : 63
    <9c3>   DW_AT_type        : <0x1635>
    <9c7>   DW_AT_external    : 1
    <9c7>   DW_AT_declaration : 1
 <3><9c7>: Abbrev Number: 37 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xadf): __digits
    <9cc>   DW_AT_decl_file   : 16
    <9cd>   DW_AT_decl_line   : 64
    <9ce>   DW_AT_type        : <0xc94>
    <9d2>   DW_AT_external    : 1
    <9d2>   DW_AT_declaration : 1
 <3><9d2>: Abbrev Number: 32 (DW_TAG_template_type_param)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xec): _Value
    <9d7>   DW_AT_type        : <0x146b>
 <3><9db>: Abbrev Number: 0
 <2><9dc>: Abbrev Number: 38 (DW_TAG_structure_type)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x1599): __numeric_traits_integer<long int>
    <9e1>   DW_AT_byte_size   : 1
    <9e2>   DW_AT_decl_file   : 16
    <9e3>   DW_AT_decl_line   : 55
 <3><9e4>: Abbrev Number: 37 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x1522): __min
    <9e9>   DW_AT_decl_file   : 16
    <9ea>   DW_AT_decl_line   : 58
    <9eb>   DW_AT_type        : <0x16df>
    <9ef>   DW_AT_external    : 1
    <9ef>   DW_AT_declaration : 1
 <3><9ef>: Abbrev Number: 37 (DW_TAG_member)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x1131): __max
    <9f4>   DW_AT_decl_file   : 16
    <9f5>   DW_AT_decl_line   : 59
    <9f6>   DW_AT_type        : <0x16df>
    <9fa>   DW_AT_external    : 1
    <9fa>   DW_AT_declaration : 1
 <3><9fa>: Abbrev Number: 37 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x1bd8): __is_signed
    <9ff>   DW_AT_decl_file   : 16
    <a00>   DW_AT_decl_line   : 63
    <a01>   DW_AT_type        : <0x1635>
    <a05>   DW_AT_external    : 1
    <a05>   DW_AT_declaration : 1
 <3><a05>: Abbrev Number: 37 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0xadf): __digits
    <a0a>   DW_AT_decl_file   : 16
    <a0b>   DW_AT_decl_line   : 64
    <a0c>   DW_AT_type        : <0xc94>
    <a10>   DW_AT_external    : 1
    <a10>   DW_AT_declaration : 1
 <3><a10>: Abbrev Number: 32 (DW_TAG_template_type_param)
    <a11>   DW_AT_name        : (indirect string, offset: 0xec): _Value
    <a15>   DW_AT_type        : <0x1245>
 <3><a19>: Abbrev Number: 0
 <2><a1a>: Abbrev Number: 0
 <1><a1b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x14b2): _IO_FILE
    <a20>   DW_AT_byte_size   : 216
    <a21>   DW_AT_decl_file   : 17
    <a22>   DW_AT_decl_line   : 241
    <a23>   DW_AT_sibling     : <0xb98>
 <2><a27>: Abbrev Number: 39 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0x1d0): _flags
    <a2c>   DW_AT_decl_file   : 17
    <a2d>   DW_AT_decl_line   : 242
    <a2e>   DW_AT_type        : <0xc70>
    <a32>   DW_AT_data_member_location: 0
 <2><a33>: Abbrev Number: 39 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0x1945): _IO_read_ptr
    <a38>   DW_AT_decl_file   : 17
    <a39>   DW_AT_decl_line   : 247
    <a3a>   DW_AT_type        : <0xfba>
    <a3e>   DW_AT_data_member_location: 8
 <2><a3f>: Abbrev Number: 39 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0x147b): _IO_read_end
    <a44>   DW_AT_decl_file   : 17
    <a45>   DW_AT_decl_line   : 248
    <a46>   DW_AT_type        : <0xfba>
    <a4a>   DW_AT_data_member_location: 16
 <2><a4b>: Abbrev Number: 39 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x103d): _IO_read_base
    <a50>   DW_AT_decl_file   : 17
    <a51>   DW_AT_decl_line   : 249
    <a52>   DW_AT_type        : <0xfba>
    <a56>   DW_AT_data_member_location: 24
 <2><a57>: Abbrev Number: 39 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0x10ed): _IO_write_base
    <a5c>   DW_AT_decl_file   : 17
    <a5d>   DW_AT_decl_line   : 250
    <a5e>   DW_AT_type        : <0xfba>
    <a62>   DW_AT_data_member_location: 32
 <2><a63>: Abbrev Number: 39 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xa96): _IO_write_ptr
    <a68>   DW_AT_decl_file   : 17
    <a69>   DW_AT_decl_line   : 251
    <a6a>   DW_AT_type        : <0xfba>
    <a6e>   DW_AT_data_member_location: 40
 <2><a6f>: Abbrev Number: 39 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0x3d7): _IO_write_end
    <a74>   DW_AT_decl_file   : 17
    <a75>   DW_AT_decl_line   : 252
    <a76>   DW_AT_type        : <0xfba>
    <a7a>   DW_AT_data_member_location: 48
 <2><a7b>: Abbrev Number: 39 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x1456): _IO_buf_base
    <a80>   DW_AT_decl_file   : 17
    <a81>   DW_AT_decl_line   : 253
    <a82>   DW_AT_type        : <0xfba>
    <a86>   DW_AT_data_member_location: 56
 <2><a87>: Abbrev Number: 39 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0x105d): _IO_buf_end
    <a8c>   DW_AT_decl_file   : 17
    <a8d>   DW_AT_decl_line   : 254
    <a8e>   DW_AT_type        : <0xfba>
    <a92>   DW_AT_data_member_location: 64
 <2><a93>: Abbrev Number: 40 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xa3d): _IO_save_base
    <a98>   DW_AT_decl_file   : 17
    <a99>   DW_AT_decl_line   : 256
    <a9b>   DW_AT_type        : <0xfba>
    <a9f>   DW_AT_data_member_location: 72
 <2><aa0>: Abbrev Number: 40 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x1922): _IO_backup_base
    <aa5>   DW_AT_decl_file   : 17
    <aa6>   DW_AT_decl_line   : 257
    <aa8>   DW_AT_type        : <0xfba>
    <aac>   DW_AT_data_member_location: 80
 <2><aad>: Abbrev Number: 40 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0xe6e): _IO_save_end
    <ab2>   DW_AT_decl_file   : 17
    <ab3>   DW_AT_decl_line   : 258
    <ab5>   DW_AT_type        : <0xfba>
    <ab9>   DW_AT_data_member_location: 88
 <2><aba>: Abbrev Number: 40 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x15c6): _markers
    <abf>   DW_AT_decl_file   : 17
    <ac0>   DW_AT_decl_line   : 260
    <ac2>   DW_AT_type        : <0x182e>
    <ac6>   DW_AT_data_member_location: 96
 <2><ac7>: Abbrev Number: 40 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x638): _chain
    <acc>   DW_AT_decl_file   : 17
    <acd>   DW_AT_decl_line   : 262
    <acf>   DW_AT_type        : <0x1834>
    <ad3>   DW_AT_data_member_location: 104
 <2><ad4>: Abbrev Number: 40 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x5d): _fileno
    <ad9>   DW_AT_decl_file   : 17
    <ada>   DW_AT_decl_line   : 264
    <adc>   DW_AT_type        : <0xc70>
    <ae0>   DW_AT_data_member_location: 112
 <2><ae1>: Abbrev Number: 40 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x1a7e): _flags2
    <ae6>   DW_AT_decl_file   : 17
    <ae7>   DW_AT_decl_line   : 268
    <ae9>   DW_AT_type        : <0xc70>
    <aed>   DW_AT_data_member_location: 116
 <2><aee>: Abbrev Number: 40 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x1a06): _old_offset
    <af3>   DW_AT_decl_file   : 17
    <af4>   DW_AT_decl_line   : 270
    <af6>   DW_AT_type        : <0x160d>
    <afa>   DW_AT_data_member_location: 120
 <2><afb>: Abbrev Number: 40 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x1305): _cur_column
    <b00>   DW_AT_decl_file   : 17
    <b01>   DW_AT_decl_line   : 274
    <b03>   DW_AT_type        : <0xc8d>
    <b07>   DW_AT_data_member_location: 128
 <2><b08>: Abbrev Number: 40 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x1c37): _vtable_offset
    <b0d>   DW_AT_decl_file   : 17
    <b0e>   DW_AT_decl_line   : 275
    <b10>   DW_AT_type        : <0x1464>
    <b14>   DW_AT_data_member_location: 130
 <2><b15>: Abbrev Number: 40 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0xf3): _shortbuf
    <b1a>   DW_AT_decl_file   : 17
    <b1b>   DW_AT_decl_line   : 276
    <b1d>   DW_AT_type        : <0x183a>
    <b21>   DW_AT_data_member_location: 131
 <2><b22>: Abbrev Number: 40 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0x25a): _lock
    <b27>   DW_AT_decl_file   : 17
    <b28>   DW_AT_decl_line   : 280
    <b2a>   DW_AT_type        : <0x184a>
    <b2e>   DW_AT_data_member_location: 136
 <2><b2f>: Abbrev Number: 40 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x1a0a): _offset
    <b34>   DW_AT_decl_file   : 17
    <b35>   DW_AT_decl_line   : 289
    <b37>   DW_AT_type        : <0x1618>
    <b3b>   DW_AT_data_member_location: 144
 <2><b3c>: Abbrev Number: 40 (DW_TAG_member)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x1576): __pad1
    <b41>   DW_AT_decl_file   : 17
    <b42>   DW_AT_decl_line   : 297
    <b44>   DW_AT_type        : <0xbf5>
    <b48>   DW_AT_data_member_location: 152
 <2><b49>: Abbrev Number: 40 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x157d): __pad2
    <b4e>   DW_AT_decl_file   : 17
    <b4f>   DW_AT_decl_line   : 298
    <b51>   DW_AT_type        : <0xbf5>
    <b55>   DW_AT_data_member_location: 160
 <2><b56>: Abbrev Number: 40 (DW_TAG_member)
    <b57>   DW_AT_name        : (indirect string, offset: 0x1584): __pad3
    <b5b>   DW_AT_decl_file   : 17
    <b5c>   DW_AT_decl_line   : 299
    <b5e>   DW_AT_type        : <0xbf5>
    <b62>   DW_AT_data_member_location: 168
 <2><b63>: Abbrev Number: 40 (DW_TAG_member)
    <b64>   DW_AT_name        : (indirect string, offset: 0x158b): __pad4
    <b68>   DW_AT_decl_file   : 17
    <b69>   DW_AT_decl_line   : 300
    <b6b>   DW_AT_type        : <0xbf5>
    <b6f>   DW_AT_data_member_location: 176
 <2><b70>: Abbrev Number: 40 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x1592): __pad5
    <b75>   DW_AT_decl_file   : 17
    <b76>   DW_AT_decl_line   : 302
    <b78>   DW_AT_type        : <0xbf7>
    <b7c>   DW_AT_data_member_location: 184
 <2><b7d>: Abbrev Number: 40 (DW_TAG_member)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x10e7): _mode
    <b82>   DW_AT_decl_file   : 17
    <b83>   DW_AT_decl_line   : 303
    <b85>   DW_AT_type        : <0xc70>
    <b89>   DW_AT_data_member_location: 192
 <2><b8a>: Abbrev Number: 40 (DW_TAG_member)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x54): _unused2
    <b8f>   DW_AT_decl_file   : 17
    <b90>   DW_AT_decl_line   : 305
    <b92>   DW_AT_type        : <0x1850>
    <b96>   DW_AT_data_member_location: 196
 <2><b97>: Abbrev Number: 0
 <1><b98>: Abbrev Number: 8 (DW_TAG_typedef)
    <b99>   DW_AT_name        : (indirect string, offset: 0x1674): __FILE
    <b9d>   DW_AT_decl_file   : 18
    <b9e>   DW_AT_decl_line   : 64
    <b9f>   DW_AT_type        : <0xa1b>
 <1><ba3>: Abbrev Number: 41 (DW_TAG_typedef)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x629): __gnuc_va_list
    <ba8>   DW_AT_decl_file   : 28
    <ba9>   DW_AT_decl_line   : 40
 <1><baa>: Abbrev Number: 42 (DW_TAG_base_type)
    <bab>   DW_AT_byte_size   : 8
    <bac>   DW_AT_encoding    : 7	(unsigned)
    <bad>   DW_AT_name        : (indirect string, offset: 0xf79): sizetype
 <1><bb1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xf82): typedef __va_list_tag __va_list_tag
    <bb6>   DW_AT_byte_size   : 24
    <bb7>   DW_AT_decl_file   : 19
    <bb8>   DW_AT_decl_line   : 0
    <bb9>   DW_AT_sibling     : <0xbee>
 <2><bbd>: Abbrev Number: 39 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0xf0f): gp_offset
    <bc2>   DW_AT_decl_file   : 19
    <bc3>   DW_AT_decl_line   : 0
    <bc4>   DW_AT_type        : <0xbee>
    <bc8>   DW_AT_data_member_location: 0
 <2><bc9>: Abbrev Number: 39 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0xec9): fp_offset
    <bce>   DW_AT_decl_file   : 19
    <bcf>   DW_AT_decl_line   : 0
    <bd0>   DW_AT_type        : <0xbee>
    <bd4>   DW_AT_data_member_location: 4
 <2><bd5>: Abbrev Number: 39 (DW_TAG_member)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x19a): overflow_arg_area
    <bda>   DW_AT_decl_file   : 19
    <bdb>   DW_AT_decl_line   : 0
    <bdc>   DW_AT_type        : <0xbf5>
    <be0>   DW_AT_data_member_location: 8
 <2><be1>: Abbrev Number: 39 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x992): reg_save_area
    <be6>   DW_AT_decl_file   : 19
    <be7>   DW_AT_decl_line   : 0
    <be8>   DW_AT_type        : <0xbf5>
    <bec>   DW_AT_data_member_location: 16
 <2><bed>: Abbrev Number: 0
 <1><bee>: Abbrev Number: 42 (DW_TAG_base_type)
    <bef>   DW_AT_byte_size   : 4
    <bf0>   DW_AT_encoding    : 7	(unsigned)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x17c8): unsigned int
 <1><bf5>: Abbrev Number: 43 (DW_TAG_pointer_type)
    <bf6>   DW_AT_byte_size   : 8
 <1><bf7>: Abbrev Number: 8 (DW_TAG_typedef)
    <bf8>   DW_AT_name        : (indirect string, offset: 0xa12): size_t
    <bfc>   DW_AT_decl_file   : 20
    <bfd>   DW_AT_decl_line   : 216
    <bfe>   DW_AT_type        : <0xc02>
 <1><c02>: Abbrev Number: 42 (DW_TAG_base_type)
    <c03>   DW_AT_byte_size   : 8
    <c04>   DW_AT_encoding    : 7	(unsigned)
    <c05>   DW_AT_name        : (indirect string, offset: 0x17c3): long unsigned int
 <1><c09>: Abbrev Number: 44 (DW_TAG_typedef)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xaba): wint_t
    <c0e>   DW_AT_decl_file   : 20
    <c0f>   DW_AT_decl_line   : 357
    <c11>   DW_AT_type        : <0xbee>
 <1><c15>: Abbrev Number: 45 (DW_TAG_structure_type)
    <c16>   DW_AT_byte_size   : 8
    <c17>   DW_AT_decl_file   : 21
    <c18>   DW_AT_decl_line   : 83
    <c19>   DW_AT_linkage_name: (indirect string, offset: 0x6c7): 11__mbstate_t
    <c1d>   DW_AT_sibling     : <0xc59>
 <2><c21>: Abbrev Number: 46 (DW_TAG_union_type)
    <c22>   DW_AT_byte_size   : 4
    <c23>   DW_AT_decl_file   : 21
    <c24>   DW_AT_decl_line   : 86
    <c25>   DW_AT_sibling     : <0xc40>
 <3><c29>: Abbrev Number: 47 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x10fc): __wch
    <c2e>   DW_AT_decl_file   : 21
    <c2f>   DW_AT_decl_line   : 88
    <c30>   DW_AT_type        : <0xbee>
 <3><c34>: Abbrev Number: 47 (DW_TAG_member)
    <c35>   DW_AT_name        : (indirect string, offset: 0xa8f): __wchb
    <c39>   DW_AT_decl_file   : 21
    <c3a>   DW_AT_decl_line   : 92
    <c3b>   DW_AT_type        : <0xc59>
 <3><c3f>: Abbrev Number: 0
 <2><c40>: Abbrev Number: 39 (DW_TAG_member)
    <c41>   DW_AT_name        : (indirect string, offset: 0xa19): __count
    <c45>   DW_AT_decl_file   : 21
    <c46>   DW_AT_decl_line   : 84
    <c47>   DW_AT_type        : <0xc70>
    <c4b>   DW_AT_data_member_location: 0
 <2><c4c>: Abbrev Number: 39 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x16c3): __value
    <c51>   DW_AT_decl_file   : 21
    <c52>   DW_AT_decl_line   : 93
    <c53>   DW_AT_type        : <0xc21>
    <c57>   DW_AT_data_member_location: 4
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 48 (DW_TAG_array_type)
    <c5a>   DW_AT_type        : <0xc69>
    <c5e>   DW_AT_sibling     : <0xc69>
 <2><c62>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <c63>   DW_AT_type        : <0xbaa>
    <c67>   DW_AT_upper_bound : 3
 <2><c68>: Abbrev Number: 0
 <1><c69>: Abbrev Number: 42 (DW_TAG_base_type)
    <c6a>   DW_AT_byte_size   : 1
    <c6b>   DW_AT_encoding    : 6	(signed char)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x6f3): char
 <1><c70>: Abbrev Number: 50 (DW_TAG_base_type)
    <c71>   DW_AT_byte_size   : 4
    <c72>   DW_AT_encoding    : 5	(signed)
    <c73>   DW_AT_name        : int
 <1><c77>: Abbrev Number: 8 (DW_TAG_typedef)
    <c78>   DW_AT_name        : (indirect string, offset: 0x6c9): __mbstate_t
    <c7c>   DW_AT_decl_file   : 21
    <c7d>   DW_AT_decl_line   : 94
    <c7e>   DW_AT_type        : <0xc15>
 <1><c82>: Abbrev Number: 8 (DW_TAG_typedef)
    <c83>   DW_AT_name        : (indirect string, offset: 0x6cb): mbstate_t
    <c87>   DW_AT_decl_file   : 21
    <c88>   DW_AT_decl_line   : 106
    <c89>   DW_AT_type        : <0xc77>
 <1><c8d>: Abbrev Number: 42 (DW_TAG_base_type)
    <c8e>   DW_AT_byte_size   : 2
    <c8f>   DW_AT_encoding    : 7	(unsigned)
    <c90>   DW_AT_name        : (indirect string, offset: 0x125): short unsigned int
 <1><c94>: Abbrev Number: 11 (DW_TAG_const_type)
    <c95>   DW_AT_type        : <0xc70>
 <1><c99>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <c9a>   DW_AT_byte_size   : 8
    <c9b>   DW_AT_type        : <0xc9f>
 <1><c9f>: Abbrev Number: 11 (DW_TAG_const_type)
    <ca0>   DW_AT_type        : <0xc69>
 <1><ca4>: Abbrev Number: 52 (DW_TAG_subprogram)
    <ca5>   DW_AT_external    : 1
    <ca5>   DW_AT_name        : (indirect string, offset: 0x5a9): btowc
    <ca9>   DW_AT_decl_file   : 21
    <caa>   DW_AT_decl_line   : 356
    <cac>   DW_AT_type        : <0xc09>
    <cb0>   DW_AT_declaration : 1
    <cb0>   DW_AT_sibling     : <0xcba>
 <2><cb4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cb5>   DW_AT_type        : <0xc70>
 <2><cb9>: Abbrev Number: 0
 <1><cba>: Abbrev Number: 52 (DW_TAG_subprogram)
    <cbb>   DW_AT_external    : 1
    <cbb>   DW_AT_name        : (indirect string, offset: 0x19af): fgetwc
    <cbf>   DW_AT_decl_file   : 21
    <cc0>   DW_AT_decl_line   : 748
    <cc2>   DW_AT_type        : <0xc09>
    <cc6>   DW_AT_declaration : 1
    <cc6>   DW_AT_sibling     : <0xcd0>
 <2><cca>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ccb>   DW_AT_type        : <0xcd0>
 <2><ccf>: Abbrev Number: 0
 <1><cd0>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <cd1>   DW_AT_byte_size   : 8
    <cd2>   DW_AT_type        : <0xb98>
 <1><cd6>: Abbrev Number: 52 (DW_TAG_subprogram)
    <cd7>   DW_AT_external    : 1
    <cd7>   DW_AT_name        : (indirect string, offset: 0x19b6): fgetws
    <cdb>   DW_AT_decl_file   : 21
    <cdc>   DW_AT_decl_line   : 777
    <cde>   DW_AT_type        : <0xcf6>
    <ce2>   DW_AT_declaration : 1
    <ce2>   DW_AT_sibling     : <0xcf6>
 <2><ce6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ce7>   DW_AT_type        : <0xcf6>
 <2><ceb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cec>   DW_AT_type        : <0xc70>
 <2><cf0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cf1>   DW_AT_type        : <0xcd0>
 <2><cf5>: Abbrev Number: 0
 <1><cf6>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <cf7>   DW_AT_byte_size   : 8
    <cf8>   DW_AT_type        : <0xcfc>
 <1><cfc>: Abbrev Number: 42 (DW_TAG_base_type)
    <cfd>   DW_AT_byte_size   : 4
    <cfe>   DW_AT_encoding    : 5	(signed)
    <cff>   DW_AT_name        : (indirect string, offset: 0x101e): wchar_t
 <1><d03>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d04>   DW_AT_external    : 1
    <d04>   DW_AT_name        : (indirect string, offset: 0xb2e): fputwc
    <d08>   DW_AT_decl_file   : 21
    <d09>   DW_AT_decl_line   : 762
    <d0b>   DW_AT_type        : <0xc09>
    <d0f>   DW_AT_declaration : 1
    <d0f>   DW_AT_sibling     : <0xd1e>
 <2><d13>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d14>   DW_AT_type        : <0xcfc>
 <2><d18>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d19>   DW_AT_type        : <0xcd0>
 <2><d1d>: Abbrev Number: 0
 <1><d1e>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d1f>   DW_AT_external    : 1
    <d1f>   DW_AT_name        : (indirect string, offset: 0xb67): fputws
    <d23>   DW_AT_decl_file   : 21
    <d24>   DW_AT_decl_line   : 784
    <d26>   DW_AT_type        : <0xc70>
    <d2a>   DW_AT_declaration : 1
    <d2a>   DW_AT_sibling     : <0xd39>
 <2><d2e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d2f>   DW_AT_type        : <0xd39>
 <2><d33>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d34>   DW_AT_type        : <0xcd0>
 <2><d38>: Abbrev Number: 0
 <1><d39>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <d3a>   DW_AT_byte_size   : 8
    <d3b>   DW_AT_type        : <0xd3f>
 <1><d3f>: Abbrev Number: 11 (DW_TAG_const_type)
    <d40>   DW_AT_type        : <0xcfc>
 <1><d44>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d45>   DW_AT_external    : 1
    <d45>   DW_AT_name        : (indirect string, offset: 0x9d): fwide
    <d49>   DW_AT_decl_file   : 21
    <d4a>   DW_AT_decl_line   : 590
    <d4c>   DW_AT_type        : <0xc70>
    <d50>   DW_AT_declaration : 1
    <d50>   DW_AT_sibling     : <0xd5f>
 <2><d54>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d55>   DW_AT_type        : <0xcd0>
 <2><d59>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d5a>   DW_AT_type        : <0xc70>
 <2><d5e>: Abbrev Number: 0
 <1><d5f>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d60>   DW_AT_external    : 1
    <d60>   DW_AT_name        : (indirect string, offset: 0xac2): fwprintf
    <d64>   DW_AT_decl_file   : 21
    <d65>   DW_AT_decl_line   : 597
    <d67>   DW_AT_type        : <0xc70>
    <d6b>   DW_AT_declaration : 1
    <d6b>   DW_AT_sibling     : <0xd7b>
 <2><d6f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d70>   DW_AT_type        : <0xcd0>
 <2><d74>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d75>   DW_AT_type        : <0xd39>
 <2><d79>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><d7a>: Abbrev Number: 0
 <1><d7b>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d7c>   DW_AT_external    : 1
    <d7c>   DW_AT_name        : (indirect string, offset: 0xab2): fwscanf
    <d80>   DW_AT_decl_file   : 21
    <d81>   DW_AT_decl_line   : 638
    <d83>   DW_AT_type        : <0xc70>
    <d87>   DW_AT_declaration : 1
    <d87>   DW_AT_sibling     : <0xd97>
 <2><d8b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d8c>   DW_AT_type        : <0xcd0>
 <2><d90>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d91>   DW_AT_type        : <0xd39>
 <2><d95>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><d96>: Abbrev Number: 0
 <1><d97>: Abbrev Number: 52 (DW_TAG_subprogram)
    <d98>   DW_AT_external    : 1
    <d98>   DW_AT_name        : (indirect string, offset: 0x19b0): getwc
    <d9c>   DW_AT_decl_file   : 21
    <d9d>   DW_AT_decl_line   : 749
    <d9f>   DW_AT_type        : <0xc09>
    <da3>   DW_AT_declaration : 1
    <da3>   DW_AT_sibling     : <0xdad>
 <2><da7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <da8>   DW_AT_type        : <0xcd0>
 <2><dac>: Abbrev Number: 0
 <1><dad>: Abbrev Number: 54 (DW_TAG_subprogram)
    <dae>   DW_AT_external    : 1
    <dae>   DW_AT_name        : (indirect string, offset: 0x1541): getwchar
    <db2>   DW_AT_decl_file   : 21
    <db3>   DW_AT_decl_line   : 755
    <db5>   DW_AT_type        : <0xc09>
    <db9>   DW_AT_declaration : 1
 <1><db9>: Abbrev Number: 52 (DW_TAG_subprogram)
    <dba>   DW_AT_external    : 1
    <dba>   DW_AT_name        : (indirect string, offset: 0x812): mbrlen
    <dbe>   DW_AT_decl_file   : 21
    <dbf>   DW_AT_decl_line   : 379
    <dc1>   DW_AT_type        : <0xbf7>
    <dc5>   DW_AT_declaration : 1
    <dc5>   DW_AT_sibling     : <0xdd9>
 <2><dc9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dca>   DW_AT_type        : <0xc99>
 <2><dce>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dcf>   DW_AT_type        : <0xbf7>
 <2><dd3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd4>   DW_AT_type        : <0xdd9>
 <2><dd8>: Abbrev Number: 0
 <1><dd9>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <dda>   DW_AT_byte_size   : 8
    <ddb>   DW_AT_type        : <0xc82>
 <1><ddf>: Abbrev Number: 52 (DW_TAG_subprogram)
    <de0>   DW_AT_external    : 1
    <de0>   DW_AT_name        : (indirect string, offset: 0x17d5): mbrtowc
    <de4>   DW_AT_decl_file   : 21
    <de5>   DW_AT_decl_line   : 368
    <de7>   DW_AT_type        : <0xbf7>
    <deb>   DW_AT_declaration : 1
    <deb>   DW_AT_sibling     : <0xe04>
 <2><def>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <df0>   DW_AT_type        : <0xcf6>
 <2><df4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <df5>   DW_AT_type        : <0xc99>
 <2><df9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dfa>   DW_AT_type        : <0xbf7>
 <2><dfe>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dff>   DW_AT_type        : <0xdd9>
 <2><e03>: Abbrev Number: 0
 <1><e04>: Abbrev Number: 52 (DW_TAG_subprogram)
    <e05>   DW_AT_external    : 1
    <e05>   DW_AT_name        : (indirect string, offset: 0xf71): mbsinit
    <e09>   DW_AT_decl_file   : 21
    <e0a>   DW_AT_decl_line   : 364
    <e0c>   DW_AT_type        : <0xc70>
    <e10>   DW_AT_declaration : 1
    <e10>   DW_AT_sibling     : <0xe1a>
 <2><e14>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e15>   DW_AT_type        : <0xe1a>
 <2><e19>: Abbrev Number: 0
 <1><e1a>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <e1b>   DW_AT_byte_size   : 8
    <e1c>   DW_AT_type        : <0xe20>
 <1><e20>: Abbrev Number: 11 (DW_TAG_const_type)
    <e21>   DW_AT_type        : <0xc82>
 <1><e25>: Abbrev Number: 52 (DW_TAG_subprogram)
    <e26>   DW_AT_external    : 1
    <e26>   DW_AT_name        : (indirect string, offset: 0xef8): mbsrtowcs
    <e2a>   DW_AT_decl_file   : 21
    <e2b>   DW_AT_decl_line   : 411
    <e2d>   DW_AT_type        : <0xbf7>
    <e31>   DW_AT_declaration : 1
    <e31>   DW_AT_sibling     : <0xe4a>
 <2><e35>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e36>   DW_AT_type        : <0xcf6>
 <2><e3a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e3b>   DW_AT_type        : <0xe4a>
 <2><e3f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e40>   DW_AT_type        : <0xbf7>
 <2><e44>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e45>   DW_AT_type        : <0xdd9>
 <2><e49>: Abbrev Number: 0
 <1><e4a>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <e4b>   DW_AT_byte_size   : 8
    <e4c>   DW_AT_type        : <0xc99>
 <1><e50>: Abbrev Number: 52 (DW_TAG_subprogram)
    <e51>   DW_AT_external    : 1
    <e51>   DW_AT_name        : (indirect string, offset: 0xb2f): putwc
    <e55>   DW_AT_decl_file   : 21
    <e56>   DW_AT_decl_line   : 763
    <e58>   DW_AT_type        : <0xc09>
    <e5c>   DW_AT_declaration : 1
    <e5c>   DW_AT_sibling     : <0xe6b>
 <2><e60>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e61>   DW_AT_type        : <0xcfc>
 <2><e65>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e66>   DW_AT_type        : <0xcd0>
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 52 (DW_TAG_subprogram)
    <e6c>   DW_AT_external    : 1
    <e6c>   DW_AT_name        : (indirect string, offset: 0x5b7): putwchar
    <e70>   DW_AT_decl_file   : 21
    <e71>   DW_AT_decl_line   : 769
    <e73>   DW_AT_type        : <0xc09>
    <e77>   DW_AT_declaration : 1
    <e77>   DW_AT_sibling     : <0xe81>
 <2><e7b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e7c>   DW_AT_type        : <0xcfc>
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 52 (DW_TAG_subprogram)
    <e82>   DW_AT_external    : 1
    <e82>   DW_AT_name        : (indirect string, offset: 0x1027): swprintf
    <e86>   DW_AT_decl_file   : 21
    <e87>   DW_AT_decl_line   : 607
    <e89>   DW_AT_type        : <0xc70>
    <e8d>   DW_AT_declaration : 1
    <e8d>   DW_AT_sibling     : <0xea2>
 <2><e91>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e92>   DW_AT_type        : <0xcf6>
 <2><e96>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e97>   DW_AT_type        : <0xbf7>
 <2><e9b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e9c>   DW_AT_type        : <0xd39>
 <2><ea0>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><ea1>: Abbrev Number: 0
 <1><ea2>: Abbrev Number: 52 (DW_TAG_subprogram)
    <ea3>   DW_AT_external    : 1
    <ea3>   DW_AT_name        : (indirect string, offset: 0x1138): swscanf
    <ea7>   DW_AT_decl_file   : 21
    <ea8>   DW_AT_decl_line   : 648
    <eaa>   DW_AT_type        : <0xc70>
    <eae>   DW_AT_declaration : 1
    <eae>   DW_AT_sibling     : <0xebe>
 <2><eb2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <eb3>   DW_AT_type        : <0xd39>
 <2><eb7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <eb8>   DW_AT_type        : <0xd39>
 <2><ebc>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><ebd>: Abbrev Number: 0
 <1><ebe>: Abbrev Number: 52 (DW_TAG_subprogram)
    <ebf>   DW_AT_external    : 1
    <ebf>   DW_AT_name        : (indirect string, offset: 0x1b0a): ungetwc
    <ec3>   DW_AT_decl_file   : 21
    <ec4>   DW_AT_decl_line   : 792
    <ec6>   DW_AT_type        : <0xc09>
    <eca>   DW_AT_declaration : 1
    <eca>   DW_AT_sibling     : <0xed9>
 <2><ece>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ecf>   DW_AT_type        : <0xc09>
 <2><ed3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ed4>   DW_AT_type        : <0xcd0>
 <2><ed8>: Abbrev Number: 0
 <1><ed9>: Abbrev Number: 52 (DW_TAG_subprogram)
    <eda>   DW_AT_external    : 1
    <eda>   DW_AT_name        : (indirect string, offset: 0xac1): vfwprintf
    <ede>   DW_AT_decl_file   : 21
    <edf>   DW_AT_decl_line   : 615
    <ee1>   DW_AT_type        : <0xc70>
    <ee5>   DW_AT_declaration : 1
    <ee5>   DW_AT_sibling     : <0xef9>
 <2><ee9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <eea>   DW_AT_type        : <0xcd0>
 <2><eee>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <eef>   DW_AT_type        : <0xd39>
 <2><ef3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ef4>   DW_AT_type        : <0xef9>
 <2><ef8>: Abbrev Number: 0
 <1><ef9>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <efa>   DW_AT_byte_size   : 8
    <efb>   DW_AT_type        : <0xbb1>
 <1><eff>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f00>   DW_AT_external    : 1
    <f00>   DW_AT_name        : (indirect string, offset: 0xab1): vfwscanf
    <f04>   DW_AT_decl_file   : 21
    <f05>   DW_AT_decl_line   : 692
    <f07>   DW_AT_type        : <0xc70>
    <f0b>   DW_AT_declaration : 1
    <f0b>   DW_AT_sibling     : <0xf1f>
 <2><f0f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f10>   DW_AT_type        : <0xcd0>
 <2><f14>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f15>   DW_AT_type        : <0xd39>
 <2><f19>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f1a>   DW_AT_type        : <0xef9>
 <2><f1e>: Abbrev Number: 0
 <1><f1f>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f20>   DW_AT_external    : 1
    <f20>   DW_AT_name        : (indirect string, offset: 0x1026): vswprintf
    <f24>   DW_AT_decl_file   : 21
    <f25>   DW_AT_decl_line   : 628
    <f27>   DW_AT_type        : <0xc70>
    <f2b>   DW_AT_declaration : 1
    <f2b>   DW_AT_sibling     : <0xf44>
 <2><f2f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f30>   DW_AT_type        : <0xcf6>
 <2><f34>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f35>   DW_AT_type        : <0xbf7>
 <2><f39>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f3a>   DW_AT_type        : <0xd39>
 <2><f3e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f3f>   DW_AT_type        : <0xef9>
 <2><f43>: Abbrev Number: 0
 <1><f44>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f45>   DW_AT_external    : 1
    <f45>   DW_AT_name        : (indirect string, offset: 0x1137): vswscanf
    <f49>   DW_AT_decl_file   : 21
    <f4a>   DW_AT_decl_line   : 704
    <f4c>   DW_AT_type        : <0xc70>
    <f50>   DW_AT_declaration : 1
    <f50>   DW_AT_sibling     : <0xf64>
 <2><f54>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f55>   DW_AT_type        : <0xd39>
 <2><f59>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f5a>   DW_AT_type        : <0xd39>
 <2><f5e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f5f>   DW_AT_type        : <0xef9>
 <2><f63>: Abbrev Number: 0
 <1><f64>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f65>   DW_AT_external    : 1
    <f65>   DW_AT_name        : (indirect string, offset: 0x11b7): vwprintf
    <f69>   DW_AT_decl_file   : 21
    <f6a>   DW_AT_decl_line   : 623
    <f6c>   DW_AT_type        : <0xc70>
    <f70>   DW_AT_declaration : 1
    <f70>   DW_AT_sibling     : <0xf7f>
 <2><f74>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f75>   DW_AT_type        : <0xd39>
 <2><f79>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f7a>   DW_AT_type        : <0xef9>
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f80>   DW_AT_external    : 1
    <f80>   DW_AT_name        : (indirect string, offset: 0x37d): vwscanf
    <f84>   DW_AT_decl_file   : 21
    <f85>   DW_AT_decl_line   : 700
    <f87>   DW_AT_type        : <0xc70>
    <f8b>   DW_AT_declaration : 1
    <f8b>   DW_AT_sibling     : <0xf9a>
 <2><f8f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f90>   DW_AT_type        : <0xd39>
 <2><f94>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f95>   DW_AT_type        : <0xef9>
 <2><f99>: Abbrev Number: 0
 <1><f9a>: Abbrev Number: 52 (DW_TAG_subprogram)
    <f9b>   DW_AT_external    : 1
    <f9b>   DW_AT_name        : (indirect string, offset: 0x16bb): wcrtomb
    <f9f>   DW_AT_decl_file   : 21
    <fa0>   DW_AT_decl_line   : 373
    <fa2>   DW_AT_type        : <0xbf7>
    <fa6>   DW_AT_declaration : 1
    <fa6>   DW_AT_sibling     : <0xfba>
 <2><faa>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fab>   DW_AT_type        : <0xfba>
 <2><faf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fb0>   DW_AT_type        : <0xcfc>
 <2><fb4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fb5>   DW_AT_type        : <0xdd9>
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <fbb>   DW_AT_byte_size   : 8
    <fbc>   DW_AT_type        : <0xc69>
 <1><fc0>: Abbrev Number: 55 (DW_TAG_subprogram)
    <fc1>   DW_AT_external    : 1
    <fc1>   DW_AT_name        : (indirect string, offset: 0x87c): wcscat
    <fc5>   DW_AT_decl_file   : 21
    <fc6>   DW_AT_decl_line   : 157
    <fc7>   DW_AT_type        : <0xcf6>
    <fcb>   DW_AT_declaration : 1
    <fcb>   DW_AT_sibling     : <0xfda>
 <2><fcf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd0>   DW_AT_type        : <0xcf6>
 <2><fd4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd5>   DW_AT_type        : <0xd39>
 <2><fd9>: Abbrev Number: 0
 <1><fda>: Abbrev Number: 55 (DW_TAG_subprogram)
    <fdb>   DW_AT_external    : 1
    <fdb>   DW_AT_name        : (indirect string, offset: 0xeba): wcscmp
    <fdf>   DW_AT_decl_file   : 21
    <fe0>   DW_AT_decl_line   : 166
    <fe1>   DW_AT_type        : <0xc70>
    <fe5>   DW_AT_declaration : 1
    <fe5>   DW_AT_sibling     : <0xff4>
 <2><fe9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fea>   DW_AT_type        : <0xd39>
 <2><fee>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fef>   DW_AT_type        : <0xd39>
 <2><ff3>: Abbrev Number: 0
 <1><ff4>: Abbrev Number: 55 (DW_TAG_subprogram)
    <ff5>   DW_AT_external    : 1
    <ff5>   DW_AT_name        : (indirect string, offset: 0x1a21): wcscoll
    <ff9>   DW_AT_decl_file   : 21
    <ffa>   DW_AT_decl_line   : 195
    <ffb>   DW_AT_type        : <0xc70>
    <fff>   DW_AT_declaration : 1
    <fff>   DW_AT_sibling     : <0x100e>
 <2><1003>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1004>   DW_AT_type        : <0xd39>
 <2><1008>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1009>   DW_AT_type        : <0xd39>
 <2><100d>: Abbrev Number: 0
 <1><100e>: Abbrev Number: 55 (DW_TAG_subprogram)
    <100f>   DW_AT_external    : 1
    <100f>   DW_AT_name        : (indirect string, offset: 0x1017): wcscpy
    <1013>   DW_AT_decl_file   : 21
    <1014>   DW_AT_decl_line   : 147
    <1015>   DW_AT_type        : <0xcf6>
    <1019>   DW_AT_declaration : 1
    <1019>   DW_AT_sibling     : <0x1028>
 <2><101d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <101e>   DW_AT_type        : <0xcf6>
 <2><1022>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1023>   DW_AT_type        : <0xd39>
 <2><1027>: Abbrev Number: 0
 <1><1028>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1029>   DW_AT_external    : 1
    <1029>   DW_AT_name        : (indirect string, offset: 0x9c8): wcscspn
    <102d>   DW_AT_decl_file   : 21
    <102e>   DW_AT_decl_line   : 255
    <102f>   DW_AT_type        : <0xbf7>
    <1033>   DW_AT_declaration : 1
    <1033>   DW_AT_sibling     : <0x1042>
 <2><1037>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1038>   DW_AT_type        : <0xd39>
 <2><103c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <103d>   DW_AT_type        : <0xd39>
 <2><1041>: Abbrev Number: 0
 <1><1042>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1043>   DW_AT_external    : 1
    <1043>   DW_AT_name        : (indirect string, offset: 0x809): wcsftime
    <1047>   DW_AT_decl_file   : 21
    <1048>   DW_AT_decl_line   : 858
    <104a>   DW_AT_type        : <0xbf7>
    <104e>   DW_AT_declaration : 1
    <104e>   DW_AT_sibling     : <0x1067>
 <2><1052>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1053>   DW_AT_type        : <0xcf6>
 <2><1057>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1058>   DW_AT_type        : <0xbf7>
 <2><105c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <105d>   DW_AT_type        : <0xd39>
 <2><1061>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1062>   DW_AT_type        : <0x1067>
 <2><1066>: Abbrev Number: 0
 <1><1067>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <1068>   DW_AT_byte_size   : 8
    <1069>   DW_AT_type        : <0x10fd>
 <1><106d>: Abbrev Number: 56 (DW_TAG_structure_type)
    <106e>   DW_AT_name        : tm
    <1071>   DW_AT_byte_size   : 56
    <1072>   DW_AT_decl_file   : 22
    <1073>   DW_AT_decl_line   : 133
    <1074>   DW_AT_sibling     : <0x10fd>
 <2><1078>: Abbrev Number: 39 (DW_TAG_member)
    <1079>   DW_AT_name        : (indirect string, offset: 0x79): tm_sec
    <107d>   DW_AT_decl_file   : 22
    <107e>   DW_AT_decl_line   : 135
    <107f>   DW_AT_type        : <0xc70>
    <1083>   DW_AT_data_member_location: 0
 <2><1084>: Abbrev Number: 39 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0xe7b): tm_min
    <1089>   DW_AT_decl_file   : 22
    <108a>   DW_AT_decl_line   : 136
    <108b>   DW_AT_type        : <0xc70>
    <108f>   DW_AT_data_member_location: 4
 <2><1090>: Abbrev Number: 39 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0x150b): tm_hour
    <1095>   DW_AT_decl_file   : 22
    <1096>   DW_AT_decl_line   : 137
    <1097>   DW_AT_type        : <0xc70>
    <109b>   DW_AT_data_member_location: 8
 <2><109c>: Abbrev Number: 39 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0x1561): tm_mday
    <10a1>   DW_AT_decl_file   : 22
    <10a2>   DW_AT_decl_line   : 138
    <10a3>   DW_AT_type        : <0xc70>
    <10a7>   DW_AT_data_member_location: 12
 <2><10a8>: Abbrev Number: 39 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x1140): tm_mon
    <10ad>   DW_AT_decl_file   : 22
    <10ae>   DW_AT_decl_line   : 139
    <10af>   DW_AT_type        : <0xc70>
    <10b3>   DW_AT_data_member_location: 16
 <2><10b4>: Abbrev Number: 39 (DW_TAG_member)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x1222): tm_year
    <10b9>   DW_AT_decl_file   : 22
    <10ba>   DW_AT_decl_line   : 140
    <10bb>   DW_AT_type        : <0xc70>
    <10bf>   DW_AT_data_member_location: 20
 <2><10c0>: Abbrev Number: 39 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x1005): tm_wday
    <10c5>   DW_AT_decl_file   : 22
    <10c6>   DW_AT_decl_line   : 141
    <10c7>   DW_AT_type        : <0xc70>
    <10cb>   DW_AT_data_member_location: 24
 <2><10cc>: Abbrev Number: 39 (DW_TAG_member)
    <10cd>   DW_AT_name        : (indirect string, offset: 0xf69): tm_yday
    <10d1>   DW_AT_decl_file   : 22
    <10d2>   DW_AT_decl_line   : 142
    <10d3>   DW_AT_type        : <0xc70>
    <10d7>   DW_AT_data_member_location: 28
 <2><10d8>: Abbrev Number: 39 (DW_TAG_member)
    <10d9>   DW_AT_name        : (indirect string, offset: 0x251): tm_isdst
    <10dd>   DW_AT_decl_file   : 22
    <10de>   DW_AT_decl_line   : 143
    <10df>   DW_AT_type        : <0xc70>
    <10e3>   DW_AT_data_member_location: 32
 <2><10e4>: Abbrev Number: 39 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x18e6): tm_gmtoff
    <10e9>   DW_AT_decl_file   : 22
    <10ea>   DW_AT_decl_line   : 146
    <10eb>   DW_AT_type        : <0x1245>
    <10ef>   DW_AT_data_member_location: 40
 <2><10f0>: Abbrev Number: 39 (DW_TAG_member)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x7f7): tm_zone
    <10f5>   DW_AT_decl_file   : 22
    <10f6>   DW_AT_decl_line   : 147
    <10f7>   DW_AT_type        : <0xc99>
    <10fb>   DW_AT_data_member_location: 48
 <2><10fc>: Abbrev Number: 0
 <1><10fd>: Abbrev Number: 11 (DW_TAG_const_type)
    <10fe>   DW_AT_type        : <0x106d>
 <1><1102>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1103>   DW_AT_external    : 1
    <1103>   DW_AT_name        : (indirect string, offset: 0x717): wcslen
    <1107>   DW_AT_decl_file   : 21
    <1108>   DW_AT_decl_line   : 290
    <110a>   DW_AT_type        : <0xbf7>
    <110e>   DW_AT_declaration : 1
    <110e>   DW_AT_sibling     : <0x1118>
 <2><1112>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1113>   DW_AT_type        : <0xd39>
 <2><1117>: Abbrev Number: 0
 <1><1118>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1119>   DW_AT_external    : 1
    <1119>   DW_AT_name        : (indirect string, offset: 0x18bf): wcsncat
    <111d>   DW_AT_decl_file   : 21
    <111e>   DW_AT_decl_line   : 161
    <111f>   DW_AT_type        : <0xcf6>
    <1123>   DW_AT_declaration : 1
    <1123>   DW_AT_sibling     : <0x1137>
 <2><1127>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1128>   DW_AT_type        : <0xcf6>
 <2><112c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <112d>   DW_AT_type        : <0xd39>
 <2><1131>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1132>   DW_AT_type        : <0xbf7>
 <2><1136>: Abbrev Number: 0
 <1><1137>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1138>   DW_AT_external    : 1
    <1138>   DW_AT_name        : (indirect string, offset: 0x162): wcsncmp
    <113c>   DW_AT_decl_file   : 21
    <113d>   DW_AT_decl_line   : 169
    <113e>   DW_AT_type        : <0xc70>
    <1142>   DW_AT_declaration : 1
    <1142>   DW_AT_sibling     : <0x1156>
 <2><1146>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1147>   DW_AT_type        : <0xd39>
 <2><114b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <114c>   DW_AT_type        : <0xd39>
 <2><1150>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1151>   DW_AT_type        : <0xbf7>
 <2><1155>: Abbrev Number: 0
 <1><1156>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1157>   DW_AT_external    : 1
    <1157>   DW_AT_name        : (indirect string, offset: 0xddc): wcsncpy
    <115b>   DW_AT_decl_file   : 21
    <115c>   DW_AT_decl_line   : 152
    <115d>   DW_AT_type        : <0xcf6>
    <1161>   DW_AT_declaration : 1
    <1161>   DW_AT_sibling     : <0x1175>
 <2><1165>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1166>   DW_AT_type        : <0xcf6>
 <2><116a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <116b>   DW_AT_type        : <0xd39>
 <2><116f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1170>   DW_AT_type        : <0xbf7>
 <2><1174>: Abbrev Number: 0
 <1><1175>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1176>   DW_AT_external    : 1
    <1176>   DW_AT_name        : (indirect string, offset: 0x10a2): wcsrtombs
    <117a>   DW_AT_decl_file   : 21
    <117b>   DW_AT_decl_line   : 417
    <117d>   DW_AT_type        : <0xbf7>
    <1181>   DW_AT_declaration : 1
    <1181>   DW_AT_sibling     : <0x119a>
 <2><1185>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1186>   DW_AT_type        : <0xfba>
 <2><118a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <118b>   DW_AT_type        : <0x119a>
 <2><118f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1190>   DW_AT_type        : <0xbf7>
 <2><1194>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1195>   DW_AT_type        : <0xdd9>
 <2><1199>: Abbrev Number: 0
 <1><119a>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <119b>   DW_AT_byte_size   : 8
    <119c>   DW_AT_type        : <0xd39>
 <1><11a0>: Abbrev Number: 52 (DW_TAG_subprogram)
    <11a1>   DW_AT_external    : 1
    <11a1>   DW_AT_name        : (indirect string, offset: 0x2b3): wcsspn
    <11a5>   DW_AT_decl_file   : 21
    <11a6>   DW_AT_decl_line   : 259
    <11a8>   DW_AT_type        : <0xbf7>
    <11ac>   DW_AT_declaration : 1
    <11ac>   DW_AT_sibling     : <0x11bb>
 <2><11b0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11b1>   DW_AT_type        : <0xd39>
 <2><11b5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11b6>   DW_AT_type        : <0xd39>
 <2><11ba>: Abbrev Number: 0
 <1><11bb>: Abbrev Number: 52 (DW_TAG_subprogram)
    <11bc>   DW_AT_external    : 1
    <11bc>   DW_AT_name        : (indirect string, offset: 0x8c0): wcstod
    <11c0>   DW_AT_decl_file   : 21
    <11c1>   DW_AT_decl_line   : 453
    <11c3>   DW_AT_type        : <0x11d6>
    <11c7>   DW_AT_declaration : 1
    <11c7>   DW_AT_sibling     : <0x11d6>
 <2><11cb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11cc>   DW_AT_type        : <0xd39>
 <2><11d0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11d1>   DW_AT_type        : <0x11dd>
 <2><11d5>: Abbrev Number: 0
 <1><11d6>: Abbrev Number: 42 (DW_TAG_base_type)
    <11d7>   DW_AT_byte_size   : 8
    <11d8>   DW_AT_encoding    : 4	(float)
    <11d9>   DW_AT_name        : (indirect string, offset: 0x12fe): double
 <1><11dd>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <11de>   DW_AT_byte_size   : 8
    <11df>   DW_AT_type        : <0xcf6>
 <1><11e3>: Abbrev Number: 52 (DW_TAG_subprogram)
    <11e4>   DW_AT_external    : 1
    <11e4>   DW_AT_name        : (indirect string, offset: 0x50e): wcstof
    <11e8>   DW_AT_decl_file   : 21
    <11e9>   DW_AT_decl_line   : 460
    <11eb>   DW_AT_type        : <0x11fe>
    <11ef>   DW_AT_declaration : 1
    <11ef>   DW_AT_sibling     : <0x11fe>
 <2><11f3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11f4>   DW_AT_type        : <0xd39>
 <2><11f8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <11f9>   DW_AT_type        : <0x11dd>
 <2><11fd>: Abbrev Number: 0
 <1><11fe>: Abbrev Number: 42 (DW_TAG_base_type)
    <11ff>   DW_AT_byte_size   : 4
    <1200>   DW_AT_encoding    : 4	(float)
    <1201>   DW_AT_name        : (indirect string, offset: 0x71e): float
 <1><1205>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1206>   DW_AT_external    : 1
    <1206>   DW_AT_name        : (indirect string, offset: 0x515): wcstok
    <120a>   DW_AT_decl_file   : 21
    <120b>   DW_AT_decl_line   : 285
    <120d>   DW_AT_type        : <0xcf6>
    <1211>   DW_AT_declaration : 1
    <1211>   DW_AT_sibling     : <0x1225>
 <2><1215>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1216>   DW_AT_type        : <0xcf6>
 <2><121a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <121b>   DW_AT_type        : <0xd39>
 <2><121f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1220>   DW_AT_type        : <0x11dd>
 <2><1224>: Abbrev Number: 0
 <1><1225>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1226>   DW_AT_external    : 1
    <1226>   DW_AT_name        : (indirect string, offset: 0x51c): wcstol
    <122a>   DW_AT_decl_file   : 21
    <122b>   DW_AT_decl_line   : 471
    <122d>   DW_AT_type        : <0x1245>
    <1231>   DW_AT_declaration : 1
    <1231>   DW_AT_sibling     : <0x1245>
 <2><1235>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1236>   DW_AT_type        : <0xd39>
 <2><123a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <123b>   DW_AT_type        : <0x11dd>
 <2><123f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1240>   DW_AT_type        : <0xc70>
 <2><1244>: Abbrev Number: 0
 <1><1245>: Abbrev Number: 42 (DW_TAG_base_type)
    <1246>   DW_AT_byte_size   : 8
    <1247>   DW_AT_encoding    : 5	(signed)
    <1248>   DW_AT_name        : (indirect string, offset: 0x1a58): long int
 <1><124c>: Abbrev Number: 52 (DW_TAG_subprogram)
    <124d>   DW_AT_external    : 1
    <124d>   DW_AT_name        : (indirect string, offset: 0x6bf): wcstoul
    <1251>   DW_AT_decl_file   : 21
    <1252>   DW_AT_decl_line   : 476
    <1254>   DW_AT_type        : <0xc02>
    <1258>   DW_AT_declaration : 1
    <1258>   DW_AT_sibling     : <0x126c>
 <2><125c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <125d>   DW_AT_type        : <0xd39>
 <2><1261>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1262>   DW_AT_type        : <0x11dd>
 <2><1266>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1267>   DW_AT_type        : <0xc70>
 <2><126b>: Abbrev Number: 0
 <1><126c>: Abbrev Number: 55 (DW_TAG_subprogram)
    <126d>   DW_AT_external    : 1
    <126d>   DW_AT_name        : (indirect string, offset: 0x704): wcsxfrm
    <1271>   DW_AT_decl_file   : 21
    <1272>   DW_AT_decl_line   : 199
    <1273>   DW_AT_type        : <0xbf7>
    <1277>   DW_AT_declaration : 1
    <1277>   DW_AT_sibling     : <0x128b>
 <2><127b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <127c>   DW_AT_type        : <0xcf6>
 <2><1280>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1281>   DW_AT_type        : <0xd39>
 <2><1285>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1286>   DW_AT_type        : <0xbf7>
 <2><128a>: Abbrev Number: 0
 <1><128b>: Abbrev Number: 52 (DW_TAG_subprogram)
    <128c>   DW_AT_external    : 1
    <128c>   DW_AT_name        : (indirect string, offset: 0xa54): wctob
    <1290>   DW_AT_decl_file   : 21
    <1291>   DW_AT_decl_line   : 360
    <1293>   DW_AT_type        : <0xc70>
    <1297>   DW_AT_declaration : 1
    <1297>   DW_AT_sibling     : <0x12a1>
 <2><129b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <129c>   DW_AT_type        : <0xc09>
 <2><12a0>: Abbrev Number: 0
 <1><12a1>: Abbrev Number: 52 (DW_TAG_subprogram)
    <12a2>   DW_AT_external    : 1
    <12a2>   DW_AT_name        : (indirect string, offset: 0x16b3): wmemcmp
    <12a6>   DW_AT_decl_file   : 21
    <12a7>   DW_AT_decl_line   : 328
    <12a9>   DW_AT_type        : <0xc70>
    <12ad>   DW_AT_declaration : 1
    <12ad>   DW_AT_sibling     : <0x12c1>
 <2><12b1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12b2>   DW_AT_type        : <0xd39>
 <2><12b6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12b7>   DW_AT_type        : <0xd39>
 <2><12bb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12bc>   DW_AT_type        : <0xbf7>
 <2><12c0>: Abbrev Number: 0
 <1><12c1>: Abbrev Number: 52 (DW_TAG_subprogram)
    <12c2>   DW_AT_external    : 1
    <12c2>   DW_AT_name        : (indirect string, offset: 0x17ea): wmemcpy
    <12c6>   DW_AT_decl_file   : 21
    <12c7>   DW_AT_decl_line   : 332
    <12c9>   DW_AT_type        : <0xcf6>
    <12cd>   DW_AT_declaration : 1
    <12cd>   DW_AT_sibling     : <0x12e1>
 <2><12d1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12d2>   DW_AT_type        : <0xcf6>
 <2><12d6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12d7>   DW_AT_type        : <0xd39>
 <2><12db>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12dc>   DW_AT_type        : <0xbf7>
 <2><12e0>: Abbrev Number: 0
 <1><12e1>: Abbrev Number: 52 (DW_TAG_subprogram)
    <12e2>   DW_AT_external    : 1
    <12e2>   DW_AT_name        : (indirect string, offset: 0xb25): wmemmove
    <12e6>   DW_AT_decl_file   : 21
    <12e7>   DW_AT_decl_line   : 337
    <12e9>   DW_AT_type        : <0xcf6>
    <12ed>   DW_AT_declaration : 1
    <12ed>   DW_AT_sibling     : <0x1301>
 <2><12f1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12f2>   DW_AT_type        : <0xcf6>
 <2><12f6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12f7>   DW_AT_type        : <0xd39>
 <2><12fb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12fc>   DW_AT_type        : <0xbf7>
 <2><1300>: Abbrev Number: 0
 <1><1301>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1302>   DW_AT_external    : 1
    <1302>   DW_AT_name        : (indirect string, offset: 0x55f): wmemset
    <1306>   DW_AT_decl_file   : 21
    <1307>   DW_AT_decl_line   : 341
    <1309>   DW_AT_type        : <0xcf6>
    <130d>   DW_AT_declaration : 1
    <130d>   DW_AT_sibling     : <0x1321>
 <2><1311>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1312>   DW_AT_type        : <0xcf6>
 <2><1316>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1317>   DW_AT_type        : <0xcfc>
 <2><131b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <131c>   DW_AT_type        : <0xbf7>
 <2><1320>: Abbrev Number: 0
 <1><1321>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1322>   DW_AT_external    : 1
    <1322>   DW_AT_name        : (indirect string, offset: 0xac3): wprintf
    <1326>   DW_AT_decl_file   : 21
    <1327>   DW_AT_decl_line   : 604
    <1329>   DW_AT_type        : <0xc70>
    <132d>   DW_AT_declaration : 1
    <132d>   DW_AT_sibling     : <0x1338>
 <2><1331>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1332>   DW_AT_type        : <0xd39>
 <2><1336>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><1337>: Abbrev Number: 0
 <1><1338>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1339>   DW_AT_external    : 1
    <1339>   DW_AT_name        : (indirect string, offset: 0xab3): wscanf
    <133d>   DW_AT_decl_file   : 21
    <133e>   DW_AT_decl_line   : 645
    <1340>   DW_AT_type        : <0xc70>
    <1344>   DW_AT_declaration : 1
    <1344>   DW_AT_sibling     : <0x134f>
 <2><1348>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1349>   DW_AT_type        : <0xd39>
 <2><134d>: Abbrev Number: 53 (DW_TAG_unspecified_parameters)
 <2><134e>: Abbrev Number: 0
 <1><134f>: Abbrev Number: 57 (DW_TAG_subprogram)
    <1350>   DW_AT_external    : 1
    <1350>   DW_AT_name        : (indirect string, offset: 0xb8d): wcschr
    <1354>   DW_AT_decl_file   : 21
    <1355>   DW_AT_decl_line   : 227
    <1356>   DW_AT_linkage_name: (indirect string, offset: 0xb8d): wcschr
    <135a>   DW_AT_type        : <0xd39>
    <135e>   DW_AT_declaration : 1
    <135e>   DW_AT_sibling     : <0x136d>
 <2><1362>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1363>   DW_AT_type        : <0xd39>
 <2><1367>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1368>   DW_AT_type        : <0xcfc>
 <2><136c>: Abbrev Number: 0
 <1><136d>: Abbrev Number: 13 (DW_TAG_subprogram)
    <136e>   DW_AT_external    : 1
    <136e>   DW_AT_name        : (indirect string, offset: 0x13): wcspbrk
    <1372>   DW_AT_decl_file   : 21
    <1373>   DW_AT_decl_line   : 265
    <1375>   DW_AT_linkage_name: (indirect string, offset: 0x13): wcspbrk
    <1379>   DW_AT_type        : <0xd39>
    <137d>   DW_AT_declaration : 1
    <137d>   DW_AT_sibling     : <0x138c>
 <2><1381>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1382>   DW_AT_type        : <0xd39>
 <2><1386>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1387>   DW_AT_type        : <0xd39>
 <2><138b>: Abbrev Number: 0
 <1><138c>: Abbrev Number: 57 (DW_TAG_subprogram)
    <138d>   DW_AT_external    : 1
    <138d>   DW_AT_name        : (indirect string, offset: 0x1a43): wcsrchr
    <1391>   DW_AT_decl_file   : 21
    <1392>   DW_AT_decl_line   : 237
    <1393>   DW_AT_linkage_name: (indirect string, offset: 0x1a43): wcsrchr
    <1397>   DW_AT_type        : <0xd39>
    <139b>   DW_AT_declaration : 1
    <139b>   DW_AT_sibling     : <0x13aa>
 <2><139f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13a0>   DW_AT_type        : <0xd39>
 <2><13a4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13a5>   DW_AT_type        : <0xcfc>
 <2><13a9>: Abbrev Number: 0
 <1><13aa>: Abbrev Number: 13 (DW_TAG_subprogram)
    <13ab>   DW_AT_external    : 1
    <13ab>   DW_AT_name        : (indirect string, offset: 0x4e8): wcsstr
    <13af>   DW_AT_decl_file   : 21
    <13b0>   DW_AT_decl_line   : 276
    <13b2>   DW_AT_linkage_name: (indirect string, offset: 0x4e8): wcsstr
    <13b6>   DW_AT_type        : <0xd39>
    <13ba>   DW_AT_declaration : 1
    <13ba>   DW_AT_sibling     : <0x13c9>
 <2><13be>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13bf>   DW_AT_type        : <0xd39>
 <2><13c3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13c4>   DW_AT_type        : <0xd39>
 <2><13c8>: Abbrev Number: 0
 <1><13c9>: Abbrev Number: 13 (DW_TAG_subprogram)
    <13ca>   DW_AT_external    : 1
    <13ca>   DW_AT_name        : (indirect string, offset: 0x14d8): wmemchr
    <13ce>   DW_AT_decl_file   : 21
    <13cf>   DW_AT_decl_line   : 319
    <13d1>   DW_AT_linkage_name: (indirect string, offset: 0x14d8): wmemchr
    <13d5>   DW_AT_type        : <0xd39>
    <13d9>   DW_AT_declaration : 1
    <13d9>   DW_AT_sibling     : <0x13ed>
 <2><13dd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13de>   DW_AT_type        : <0xd39>
 <2><13e2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13e3>   DW_AT_type        : <0xcfc>
 <2><13e7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13e8>   DW_AT_type        : <0xbf7>
 <2><13ec>: Abbrev Number: 0
 <1><13ed>: Abbrev Number: 52 (DW_TAG_subprogram)
    <13ee>   DW_AT_external    : 1
    <13ee>   DW_AT_name        : (indirect string, offset: 0x13f3): wcstold
    <13f2>   DW_AT_decl_file   : 21
    <13f3>   DW_AT_decl_line   : 462
    <13f5>   DW_AT_type        : <0x1408>
    <13f9>   DW_AT_declaration : 1
    <13f9>   DW_AT_sibling     : <0x1408>
 <2><13fd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13fe>   DW_AT_type        : <0xd39>
 <2><1402>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1403>   DW_AT_type        : <0x11dd>
 <2><1407>: Abbrev Number: 0
 <1><1408>: Abbrev Number: 42 (DW_TAG_base_type)
    <1409>   DW_AT_byte_size   : 16
    <140a>   DW_AT_encoding    : 4	(float)
    <140b>   DW_AT_name        : (indirect string, offset: 0x12f9): long double
 <1><140f>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1410>   DW_AT_external    : 1
    <1410>   DW_AT_name        : (indirect string, offset: 0x260): wcstoll
    <1414>   DW_AT_decl_file   : 21
    <1415>   DW_AT_decl_line   : 486
    <1417>   DW_AT_type        : <0x142f>
    <141b>   DW_AT_declaration : 1
    <141b>   DW_AT_sibling     : <0x142f>
 <2><141f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1420>   DW_AT_type        : <0xd39>
 <2><1424>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1425>   DW_AT_type        : <0x11dd>
 <2><1429>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <142a>   DW_AT_type        : <0xc70>
 <2><142e>: Abbrev Number: 0
 <1><142f>: Abbrev Number: 42 (DW_TAG_base_type)
    <1430>   DW_AT_byte_size   : 8
    <1431>   DW_AT_encoding    : 5	(signed)
    <1432>   DW_AT_name        : (indirect string, offset: 0x1a53): long long int
 <1><1436>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1437>   DW_AT_external    : 1
    <1437>   DW_AT_name        : (indirect string, offset: 0xaf0): wcstoull
    <143b>   DW_AT_decl_file   : 21
    <143c>   DW_AT_decl_line   : 493
    <143e>   DW_AT_type        : <0x1456>
    <1442>   DW_AT_declaration : 1
    <1442>   DW_AT_sibling     : <0x1456>
 <2><1446>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1447>   DW_AT_type        : <0xd39>
 <2><144b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <144c>   DW_AT_type        : <0x11dd>
 <2><1450>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1451>   DW_AT_type        : <0xc70>
 <2><1455>: Abbrev Number: 0
 <1><1456>: Abbrev Number: 42 (DW_TAG_base_type)
    <1457>   DW_AT_byte_size   : 8
    <1458>   DW_AT_encoding    : 7	(unsigned)
    <1459>   DW_AT_name        : (indirect string, offset: 0x17be): long long unsigned int
 <1><145d>: Abbrev Number: 42 (DW_TAG_base_type)
    <145e>   DW_AT_byte_size   : 1
    <145f>   DW_AT_encoding    : 8	(unsigned char)
    <1460>   DW_AT_name        : (indirect string, offset: 0x6ea): unsigned char
 <1><1464>: Abbrev Number: 42 (DW_TAG_base_type)
    <1465>   DW_AT_byte_size   : 1
    <1466>   DW_AT_encoding    : 6	(signed char)
    <1467>   DW_AT_name        : (indirect string, offset: 0x6ec): signed char
 <1><146b>: Abbrev Number: 42 (DW_TAG_base_type)
    <146c>   DW_AT_byte_size   : 2
    <146d>   DW_AT_encoding    : 5	(signed)
    <146e>   DW_AT_name        : (indirect string, offset: 0x1c1b): short int
 <1><1472>: Abbrev Number: 36 (DW_TAG_namespace)
    <1473>   DW_AT_name        : (indirect string, offset: 0x553): __gnu_debug
    <1477>   DW_AT_decl_file   : 5
    <1478>   DW_AT_decl_line   : 55
    <1479>   DW_AT_sibling     : <0x1485>
 <2><147d>: Abbrev Number: 4 (DW_TAG_imported_module)
    <147e>   DW_AT_decl_file   : 5
    <147f>   DW_AT_decl_line   : 56
    <1480>   DW_AT_import      : <0x1f4>	[Abbrev Number: 3 (DW_TAG_namespace)]
 <2><1484>: Abbrev Number: 0
 <1><1485>: Abbrev Number: 58 (DW_TAG_reference_type)
    <1486>   DW_AT_byte_size   : 8
    <1487>   DW_AT_type        : <0x207>
 <1><148b>: Abbrev Number: 58 (DW_TAG_reference_type)
    <148c>   DW_AT_byte_size   : 8
    <148d>   DW_AT_type        : <0x237>
 <1><1491>: Abbrev Number: 42 (DW_TAG_base_type)
    <1492>   DW_AT_byte_size   : 1
    <1493>   DW_AT_encoding    : 2	(boolean)
    <1494>   DW_AT_name        : (indirect string, offset: 0x279): bool
 <1><1498>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <1499>   DW_AT_byte_size   : 8
    <149a>   DW_AT_type        : <0x237>
 <1><149e>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <149f>   DW_AT_byte_size   : 8
    <14a0>   DW_AT_type        : <0x207>
 <1><14a4>: Abbrev Number: 58 (DW_TAG_reference_type)
    <14a5>   DW_AT_byte_size   : 8
    <14a6>   DW_AT_type        : <0x35e>
 <1><14aa>: Abbrev Number: 7 (DW_TAG_structure_type)
    <14ab>   DW_AT_name        : (indirect string, offset: 0x1b): lconv
    <14af>   DW_AT_byte_size   : 96
    <14b0>   DW_AT_decl_file   : 23
    <14b1>   DW_AT_decl_line   : 53
    <14b2>   DW_AT_sibling     : <0x15d7>
 <2><14b6>: Abbrev Number: 39 (DW_TAG_member)
    <14b7>   DW_AT_name        : (indirect string, offset: 0x1291): decimal_point
    <14bb>   DW_AT_decl_file   : 23
    <14bc>   DW_AT_decl_line   : 57
    <14bd>   DW_AT_type        : <0xfba>
    <14c1>   DW_AT_data_member_location: 0
 <2><14c2>: Abbrev Number: 39 (DW_TAG_member)
    <14c3>   DW_AT_name        : (indirect string, offset: 0xa5e): thousands_sep
    <14c7>   DW_AT_decl_file   : 23
    <14c8>   DW_AT_decl_line   : 58
    <14c9>   DW_AT_type        : <0xfba>
    <14cd>   DW_AT_data_member_location: 8
 <2><14ce>: Abbrev Number: 39 (DW_TAG_member)
    <14cf>   DW_AT_name        : (indirect string, offset: 0xf06): grouping
    <14d3>   DW_AT_decl_file   : 23
    <14d4>   DW_AT_decl_line   : 64
    <14d5>   DW_AT_type        : <0xfba>
    <14d9>   DW_AT_data_member_location: 16
 <2><14da>: Abbrev Number: 39 (DW_TAG_member)
    <14db>   DW_AT_name        : (indirect string, offset: 0x8f1): int_curr_symbol
    <14df>   DW_AT_decl_file   : 23
    <14e0>   DW_AT_decl_line   : 70
    <14e1>   DW_AT_type        : <0xfba>
    <14e5>   DW_AT_data_member_location: 24
 <2><14e6>: Abbrev Number: 39 (DW_TAG_member)
    <14e7>   DW_AT_name        : (indirect string, offset: 0x5cb): currency_symbol
    <14eb>   DW_AT_decl_file   : 23
    <14ec>   DW_AT_decl_line   : 71
    <14ed>   DW_AT_type        : <0xfba>
    <14f1>   DW_AT_data_member_location: 32
 <2><14f2>: Abbrev Number: 39 (DW_TAG_member)
    <14f3>   DW_AT_name        : (indirect string, offset: 0x128d): mon_decimal_point
    <14f7>   DW_AT_decl_file   : 23
    <14f8>   DW_AT_decl_line   : 72
    <14f9>   DW_AT_type        : <0xfba>
    <14fd>   DW_AT_data_member_location: 40
 <2><14fe>: Abbrev Number: 39 (DW_TAG_member)
    <14ff>   DW_AT_name        : (indirect string, offset: 0xa5a): mon_thousands_sep
    <1503>   DW_AT_decl_file   : 23
    <1504>   DW_AT_decl_line   : 73
    <1505>   DW_AT_type        : <0xfba>
    <1509>   DW_AT_data_member_location: 48
 <2><150a>: Abbrev Number: 39 (DW_TAG_member)
    <150b>   DW_AT_name        : (indirect string, offset: 0xf02): mon_grouping
    <150f>   DW_AT_decl_file   : 23
    <1510>   DW_AT_decl_line   : 74
    <1511>   DW_AT_type        : <0xfba>
    <1515>   DW_AT_data_member_location: 56
 <2><1516>: Abbrev Number: 39 (DW_TAG_member)
    <1517>   DW_AT_name        : (indirect string, offset: 0x1712): positive_sign
    <151b>   DW_AT_decl_file   : 23
    <151c>   DW_AT_decl_line   : 75
    <151d>   DW_AT_type        : <0xfba>
    <1521>   DW_AT_data_member_location: 64
 <2><1522>: Abbrev Number: 39 (DW_TAG_member)
    <1523>   DW_AT_name        : (indirect string, offset: 0x86e): negative_sign
    <1527>   DW_AT_decl_file   : 23
    <1528>   DW_AT_decl_line   : 76
    <1529>   DW_AT_type        : <0xfba>
    <152d>   DW_AT_data_member_location: 72
 <2><152e>: Abbrev Number: 39 (DW_TAG_member)
    <152f>   DW_AT_name        : (indirect string, offset: 0x4fe): int_frac_digits
    <1533>   DW_AT_decl_file   : 23
    <1534>   DW_AT_decl_line   : 77
    <1535>   DW_AT_type        : <0xc69>
    <1539>   DW_AT_data_member_location: 80
 <2><153a>: Abbrev Number: 39 (DW_TAG_member)
    <153b>   DW_AT_name        : (indirect string, offset: 0x502): frac_digits
    <153f>   DW_AT_decl_file   : 23
    <1540>   DW_AT_decl_line   : 78
    <1541>   DW_AT_type        : <0xc69>
    <1545>   DW_AT_data_member_location: 81
 <2><1546>: Abbrev Number: 39 (DW_TAG_member)
    <1547>   DW_AT_name        : (indirect string, offset: 0x1c29): p_cs_precedes
    <154b>   DW_AT_decl_file   : 23
    <154c>   DW_AT_decl_line   : 80
    <154d>   DW_AT_type        : <0xc69>
    <1551>   DW_AT_data_member_location: 82
 <2><1552>: Abbrev Number: 39 (DW_TAG_member)
    <1553>   DW_AT_name        : (indirect string, offset: 0xb6): p_sep_by_space
    <1557>   DW_AT_decl_file   : 23
    <1558>   DW_AT_decl_line   : 82
    <1559>   DW_AT_type        : <0xc69>
    <155d>   DW_AT_data_member_location: 83
 <2><155e>: Abbrev Number: 39 (DW_TAG_member)
    <155f>   DW_AT_name        : (indirect string, offset: 0x643): n_cs_precedes
    <1563>   DW_AT_decl_file   : 23
    <1564>   DW_AT_decl_line   : 84
    <1565>   DW_AT_type        : <0xc69>
    <1569>   DW_AT_data_member_location: 84
 <2><156a>: Abbrev Number: 39 (DW_TAG_member)
    <156b>   DW_AT_name        : (indirect string, offset: 0x1936): n_sep_by_space
    <156f>   DW_AT_decl_file   : 23
    <1570>   DW_AT_decl_line   : 86
    <1571>   DW_AT_type        : <0xc69>
    <1575>   DW_AT_data_member_location: 85
 <2><1576>: Abbrev Number: 39 (DW_TAG_member)
    <1577>   DW_AT_name        : (indirect string, offset: 0x1209): p_sign_posn
    <157b>   DW_AT_decl_file   : 23
    <157c>   DW_AT_decl_line   : 93
    <157d>   DW_AT_type        : <0xc69>
    <1581>   DW_AT_data_member_location: 86
 <2><1582>: Abbrev Number: 39 (DW_TAG_member)
    <1583>   DW_AT_name        : (indirect string, offset: 0x1555): n_sign_posn
    <1587>   DW_AT_decl_file   : 23
    <1588>   DW_AT_decl_line   : 94
    <1589>   DW_AT_type        : <0xc69>
    <158d>   DW_AT_data_member_location: 87
 <2><158e>: Abbrev Number: 39 (DW_TAG_member)
    <158f>   DW_AT_name        : (indirect string, offset: 0x1c25): int_p_cs_precedes
    <1593>   DW_AT_decl_file   : 23
    <1594>   DW_AT_decl_line   : 97
    <1595>   DW_AT_type        : <0xc69>
    <1599>   DW_AT_data_member_location: 88
 <2><159a>: Abbrev Number: 39 (DW_TAG_member)
    <159b>   DW_AT_name        : (indirect string, offset: 0xb2): int_p_sep_by_space
    <159f>   DW_AT_decl_file   : 23
    <15a0>   DW_AT_decl_line   : 99
    <15a1>   DW_AT_type        : <0xc69>
    <15a5>   DW_AT_data_member_location: 89
 <2><15a6>: Abbrev Number: 39 (DW_TAG_member)
    <15a7>   DW_AT_name        : (indirect string, offset: 0x63f): int_n_cs_precedes
    <15ab>   DW_AT_decl_file   : 23
    <15ac>   DW_AT_decl_line   : 101
    <15ad>   DW_AT_type        : <0xc69>
    <15b1>   DW_AT_data_member_location: 90
 <2><15b2>: Abbrev Number: 39 (DW_TAG_member)
    <15b3>   DW_AT_name        : (indirect string, offset: 0x1932): int_n_sep_by_space
    <15b7>   DW_AT_decl_file   : 23
    <15b8>   DW_AT_decl_line   : 103
    <15b9>   DW_AT_type        : <0xc69>
    <15bd>   DW_AT_data_member_location: 91
 <2><15be>: Abbrev Number: 39 (DW_TAG_member)
    <15bf>   DW_AT_name        : (indirect string, offset: 0x1205): int_p_sign_posn
    <15c3>   DW_AT_decl_file   : 23
    <15c4>   DW_AT_decl_line   : 110
    <15c5>   DW_AT_type        : <0xc69>
    <15c9>   DW_AT_data_member_location: 92
 <2><15ca>: Abbrev Number: 39 (DW_TAG_member)
    <15cb>   DW_AT_name        : (indirect string, offset: 0x1551): int_n_sign_posn
    <15cf>   DW_AT_decl_file   : 23
    <15d0>   DW_AT_decl_line   : 111
    <15d1>   DW_AT_type        : <0xc69>
    <15d5>   DW_AT_data_member_location: 93
 <2><15d6>: Abbrev Number: 0
 <1><15d7>: Abbrev Number: 55 (DW_TAG_subprogram)
    <15d8>   DW_AT_external    : 1
    <15d8>   DW_AT_name        : (indirect string, offset: 0x359): setlocale
    <15dc>   DW_AT_decl_file   : 23
    <15dd>   DW_AT_decl_line   : 124
    <15de>   DW_AT_type        : <0xfba>
    <15e2>   DW_AT_declaration : 1
    <15e2>   DW_AT_sibling     : <0x15f1>
 <2><15e6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <15e7>   DW_AT_type        : <0xc70>
 <2><15eb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <15ec>   DW_AT_type        : <0xc99>
 <2><15f0>: Abbrev Number: 0
 <1><15f1>: Abbrev Number: 59 (DW_TAG_subprogram)
    <15f2>   DW_AT_external    : 1
    <15f2>   DW_AT_name        : (indirect string, offset: 0x1ba5): localeconv
    <15f6>   DW_AT_decl_file   : 23
    <15f7>   DW_AT_decl_line   : 127
    <15f8>   DW_AT_type        : <0x15fc>
    <15fc>   DW_AT_declaration : 1
 <1><15fc>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <15fd>   DW_AT_byte_size   : 8
    <15fe>   DW_AT_type        : <0x14aa>
 <1><1602>: Abbrev Number: 8 (DW_TAG_typedef)
    <1603>   DW_AT_name        : (indirect string, offset: 0x16a9): __int32_t
    <1607>   DW_AT_decl_file   : 24
    <1608>   DW_AT_decl_line   : 40
    <1609>   DW_AT_type        : <0xc70>
 <1><160d>: Abbrev Number: 8 (DW_TAG_typedef)
    <160e>   DW_AT_name        : (indirect string, offset: 0x21b): __off_t
    <1612>   DW_AT_decl_file   : 24
    <1613>   DW_AT_decl_line   : 131
    <1614>   DW_AT_type        : <0x1245>
 <1><1618>: Abbrev Number: 8 (DW_TAG_typedef)
    <1619>   DW_AT_name        : (indirect string, offset: 0x100d): __off64_t
    <161d>   DW_AT_decl_file   : 24
    <161e>   DW_AT_decl_line   : 132
    <161f>   DW_AT_type        : <0x1245>
 <1><1623>: Abbrev Number: 8 (DW_TAG_typedef)
    <1624>   DW_AT_name        : (indirect string, offset: 0xbe4): _Atomic_word
    <1628>   DW_AT_decl_file   : 25
    <1629>   DW_AT_decl_line   : 32
    <162a>   DW_AT_type        : <0xc70>
 <1><162e>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <162f>   DW_AT_byte_size   : 8
    <1630>   DW_AT_type        : <0x1634>
 <1><1634>: Abbrev Number: 60 (DW_TAG_const_type)
 <1><1635>: Abbrev Number: 11 (DW_TAG_const_type)
    <1636>   DW_AT_type        : <0x1491>
 <1><163a>: Abbrev Number: 48 (DW_TAG_array_type)
    <163b>   DW_AT_type        : <0xc69>
    <163f>   DW_AT_sibling     : <0x164a>
 <2><1643>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <1644>   DW_AT_type        : <0xbaa>
    <1648>   DW_AT_upper_bound : 15
 <2><1649>: Abbrev Number: 0
 <1><164a>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <164b>   DW_AT_byte_size   : 8
    <164c>   DW_AT_type        : <0xfba>
 <1><1650>: Abbrev Number: 11 (DW_TAG_const_type)
    <1651>   DW_AT_type        : <0xc02>
 <1><1655>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <1656>   DW_AT_byte_size   : 8
    <1657>   DW_AT_type        : <0x562>
 <1><165b>: Abbrev Number: 8 (DW_TAG_typedef)
    <165c>   DW_AT_name        : (indirect string, offset: 0x13e0): wctype_t
    <1660>   DW_AT_decl_file   : 26
    <1661>   DW_AT_decl_line   : 52
    <1662>   DW_AT_type        : <0xc02>
 <1><1666>: Abbrev Number: 8 (DW_TAG_typedef)
    <1667>   DW_AT_name        : (indirect string, offset: 0x1a29): wctrans_t
    <166b>   DW_AT_decl_file   : 26
    <166c>   DW_AT_decl_line   : 186
    <166d>   DW_AT_type        : <0x1671>
 <1><1671>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <1672>   DW_AT_byte_size   : 8
    <1673>   DW_AT_type        : <0x1677>
 <1><1677>: Abbrev Number: 11 (DW_TAG_const_type)
    <1678>   DW_AT_type        : <0x1602>
 <1><167c>: Abbrev Number: 55 (DW_TAG_subprogram)
    <167d>   DW_AT_external    : 1
    <167d>   DW_AT_name        : (indirect string, offset: 0x1d7): iswctype
    <1681>   DW_AT_decl_file   : 26
    <1682>   DW_AT_decl_line   : 175
    <1683>   DW_AT_type        : <0xc70>
    <1687>   DW_AT_declaration : 1
    <1687>   DW_AT_sibling     : <0x1696>
 <2><168b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <168c>   DW_AT_type        : <0xc09>
 <2><1690>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1691>   DW_AT_type        : <0x165b>
 <2><1695>: Abbrev Number: 0
 <1><1696>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1697>   DW_AT_external    : 1
    <1697>   DW_AT_name        : (indirect string, offset: 0x247): towctrans
    <169b>   DW_AT_decl_file   : 26
    <169c>   DW_AT_decl_line   : 221
    <169d>   DW_AT_type        : <0xc09>
    <16a1>   DW_AT_declaration : 1
    <16a1>   DW_AT_sibling     : <0x16b0>
 <2><16a5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16a6>   DW_AT_type        : <0xc09>
 <2><16aa>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16ab>   DW_AT_type        : <0x1666>
 <2><16af>: Abbrev Number: 0
 <1><16b0>: Abbrev Number: 55 (DW_TAG_subprogram)
    <16b1>   DW_AT_external    : 1
    <16b1>   DW_AT_name        : (indirect string, offset: 0x249): wctrans
    <16b5>   DW_AT_decl_file   : 26
    <16b6>   DW_AT_decl_line   : 218
    <16b7>   DW_AT_type        : <0x1666>
    <16bb>   DW_AT_declaration : 1
    <16bb>   DW_AT_sibling     : <0x16c5>
 <2><16bf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16c0>   DW_AT_type        : <0xc99>
 <2><16c4>: Abbrev Number: 0
 <1><16c5>: Abbrev Number: 55 (DW_TAG_subprogram)
    <16c6>   DW_AT_external    : 1
    <16c6>   DW_AT_name        : (indirect string, offset: 0x1d9): wctype
    <16ca>   DW_AT_decl_file   : 26
    <16cb>   DW_AT_decl_line   : 171
    <16cc>   DW_AT_type        : <0x165b>
    <16d0>   DW_AT_declaration : 1
    <16d0>   DW_AT_sibling     : <0x16da>
 <2><16d4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16d5>   DW_AT_type        : <0xc99>
 <2><16d9>: Abbrev Number: 0
 <1><16da>: Abbrev Number: 11 (DW_TAG_const_type)
    <16db>   DW_AT_type        : <0x146b>
 <1><16df>: Abbrev Number: 11 (DW_TAG_const_type)
    <16e0>   DW_AT_type        : <0x1245>
 <1><16e4>: Abbrev Number: 57 (DW_TAG_subprogram)
    <16e5>   DW_AT_external    : 1
    <16e5>   DW_AT_name        : (indirect string, offset: 0x14d9): memchr
    <16e9>   DW_AT_decl_file   : 27
    <16ea>   DW_AT_decl_line   : 74
    <16eb>   DW_AT_linkage_name: (indirect string, offset: 0x14d9): memchr
    <16ef>   DW_AT_type        : <0x162e>
    <16f3>   DW_AT_declaration : 1
    <16f3>   DW_AT_sibling     : <0x1707>
 <2><16f7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16f8>   DW_AT_type        : <0x162e>
 <2><16fc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <16fd>   DW_AT_type        : <0xc70>
 <2><1701>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1702>   DW_AT_type        : <0xbf7>
 <2><1706>: Abbrev Number: 0
 <1><1707>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1708>   DW_AT_external    : 1
    <1708>   DW_AT_name        : (indirect string, offset: 0x2ab): strcoll
    <170c>   DW_AT_decl_file   : 27
    <170d>   DW_AT_decl_line   : 147
    <170e>   DW_AT_type        : <0xc70>
    <1712>   DW_AT_declaration : 1
    <1712>   DW_AT_sibling     : <0x1721>
 <2><1716>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1717>   DW_AT_type        : <0xc99>
 <2><171b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <171c>   DW_AT_type        : <0xc99>
 <2><1720>: Abbrev Number: 0
 <1><1721>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1722>   DW_AT_external    : 1
    <1722>   DW_AT_name        : (indirect string, offset: 0xc43): strerror
    <1726>   DW_AT_decl_file   : 27
    <1727>   DW_AT_decl_line   : 408
    <1729>   DW_AT_type        : <0xfba>
    <172d>   DW_AT_declaration : 1
    <172d>   DW_AT_sibling     : <0x1737>
 <2><1731>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1732>   DW_AT_type        : <0xc70>
 <2><1736>: Abbrev Number: 0
 <1><1737>: Abbrev Number: 52 (DW_TAG_subprogram)
    <1738>   DW_AT_external    : 1
    <1738>   DW_AT_name        : (indirect string, offset: 0x12f2): strtok
    <173c>   DW_AT_decl_file   : 27
    <173d>   DW_AT_decl_line   : 343
    <173f>   DW_AT_type        : <0xfba>
    <1743>   DW_AT_declaration : 1
    <1743>   DW_AT_sibling     : <0x1752>
 <2><1747>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1748>   DW_AT_type        : <0xfba>
 <2><174c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <174d>   DW_AT_type        : <0xc99>
 <2><1751>: Abbrev Number: 0
 <1><1752>: Abbrev Number: 55 (DW_TAG_subprogram)
    <1753>   DW_AT_external    : 1
    <1753>   DW_AT_name        : (indirect string, offset: 0xc68): strxfrm
    <1757>   DW_AT_decl_file   : 27
    <1758>   DW_AT_decl_line   : 150
    <1759>   DW_AT_type        : <0xbf7>
    <175d>   DW_AT_declaration : 1
    <175d>   DW_AT_sibling     : <0x1771>
 <2><1761>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1762>   DW_AT_type        : <0xfba>
 <2><1766>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1767>   DW_AT_type        : <0xc99>
 <2><176b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <176c>   DW_AT_type        : <0xbf7>
 <2><1770>: Abbrev Number: 0
 <1><1771>: Abbrev Number: 57 (DW_TAG_subprogram)
    <1772>   DW_AT_external    : 1
    <1772>   DW_AT_name        : (indirect string, offset: 0x1a12): strchr
    <1776>   DW_AT_decl_file   : 27
    <1777>   DW_AT_decl_line   : 213
    <1778>   DW_AT_linkage_name: (indirect string, offset: 0x1a12): strchr
    <177c>   DW_AT_type        : <0xc99>
    <1780>   DW_AT_declaration : 1
    <1780>   DW_AT_sibling     : <0x178f>
 <2><1784>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1785>   DW_AT_type        : <0xc99>
 <2><1789>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <178a>   DW_AT_type        : <0xc70>
 <2><178e>: Abbrev Number: 0
 <1><178f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <1790>   DW_AT_external    : 1
    <1790>   DW_AT_name        : (indirect string, offset: 0x5af): strpbrk
    <1794>   DW_AT_decl_file   : 27
    <1795>   DW_AT_decl_line   : 292
    <1797>   DW_AT_linkage_name: (indirect string, offset: 0x5af): strpbrk
    <179b>   DW_AT_type        : <0xc99>
    <179f>   DW_AT_declaration : 1
    <179f>   DW_AT_sibling     : <0x17ae>
 <2><17a3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17a4>   DW_AT_type        : <0xc99>
 <2><17a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17a9>   DW_AT_type        : <0xc99>
 <2><17ad>: Abbrev Number: 0
 <1><17ae>: Abbrev Number: 57 (DW_TAG_subprogram)
    <17af>   DW_AT_external    : 1
    <17af>   DW_AT_name        : (indirect string, offset: 0x2e4): strrchr
    <17b3>   DW_AT_decl_file   : 27
    <17b4>   DW_AT_decl_line   : 240
    <17b5>   DW_AT_linkage_name: (indirect string, offset: 0x2e4): strrchr
    <17b9>   DW_AT_type        : <0xc99>
    <17bd>   DW_AT_declaration : 1
    <17bd>   DW_AT_sibling     : <0x17cc>
 <2><17c1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17c2>   DW_AT_type        : <0xc99>
 <2><17c6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17c7>   DW_AT_type        : <0xc70>
 <2><17cb>: Abbrev Number: 0
 <1><17cc>: Abbrev Number: 13 (DW_TAG_subprogram)
    <17cd>   DW_AT_external    : 1
    <17cd>   DW_AT_name        : (indirect string, offset: 0x1286): strstr
    <17d1>   DW_AT_decl_file   : 27
    <17d2>   DW_AT_decl_line   : 319
    <17d4>   DW_AT_linkage_name: (indirect string, offset: 0x1286): strstr
    <17d8>   DW_AT_type        : <0xc99>
    <17dc>   DW_AT_declaration : 1
    <17dc>   DW_AT_sibling     : <0x17eb>
 <2><17e0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17e1>   DW_AT_type        : <0xc99>
 <2><17e5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <17e6>   DW_AT_type        : <0xc99>
 <2><17ea>: Abbrev Number: 0
 <1><17eb>: Abbrev Number: 8 (DW_TAG_typedef)
    <17ec>   DW_AT_name        : (indirect string, offset: 0x630): va_list
    <17f0>   DW_AT_decl_file   : 28
    <17f1>   DW_AT_decl_line   : 98
    <17f2>   DW_AT_type        : <0xba3>
 <1><17f6>: Abbrev Number: 41 (DW_TAG_typedef)
    <17f7>   DW_AT_name        : (indirect string, offset: 0x70c): _IO_lock_t
    <17fb>   DW_AT_decl_file   : 17
    <17fc>   DW_AT_decl_line   : 150
 <1><17fd>: Abbrev Number: 7 (DW_TAG_structure_type)
    <17fe>   DW_AT_name        : (indirect string, offset: 0x11fa): _IO_marker
    <1802>   DW_AT_byte_size   : 24
    <1803>   DW_AT_decl_file   : 17
    <1804>   DW_AT_decl_line   : 156
    <1805>   DW_AT_sibling     : <0x182e>
 <2><1809>: Abbrev Number: 39 (DW_TAG_member)
    <180a>   DW_AT_name        : (indirect string, offset: 0xba0): _next
    <180e>   DW_AT_decl_file   : 17
    <180f>   DW_AT_decl_line   : 157
    <1810>   DW_AT_type        : <0x182e>
    <1814>   DW_AT_data_member_location: 0
 <2><1815>: Abbrev Number: 39 (DW_TAG_member)
    <1816>   DW_AT_name        : (indirect string, offset: 0xe45): _sbuf
    <181a>   DW_AT_decl_file   : 17
    <181b>   DW_AT_decl_line   : 158
    <181c>   DW_AT_type        : <0x1834>
    <1820>   DW_AT_data_member_location: 8
 <2><1821>: Abbrev Number: 39 (DW_TAG_member)
    <1822>   DW_AT_name        : (indirect string, offset: 0x15cf): _pos
    <1826>   DW_AT_decl_file   : 17
    <1827>   DW_AT_decl_line   : 162
    <1828>   DW_AT_type        : <0xc70>
    <182c>   DW_AT_data_member_location: 16
 <2><182d>: Abbrev Number: 0
 <1><182e>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <182f>   DW_AT_byte_size   : 8
    <1830>   DW_AT_type        : <0x17fd>
 <1><1834>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <1835>   DW_AT_byte_size   : 8
    <1836>   DW_AT_type        : <0xa1b>
 <1><183a>: Abbrev Number: 48 (DW_TAG_array_type)
    <183b>   DW_AT_type        : <0xc69>
    <183f>   DW_AT_sibling     : <0x184a>
 <2><1843>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <1844>   DW_AT_type        : <0xbaa>
    <1848>   DW_AT_upper_bound : 0
 <2><1849>: Abbrev Number: 0
 <1><184a>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <184b>   DW_AT_byte_size   : 8
    <184c>   DW_AT_type        : <0x17f6>
 <1><1850>: Abbrev Number: 48 (DW_TAG_array_type)
    <1851>   DW_AT_type        : <0xc69>
    <1855>   DW_AT_sibling     : <0x1860>
 <2><1859>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <185a>   DW_AT_type        : <0xbaa>
    <185e>   DW_AT_upper_bound : 19
 <2><185f>: Abbrev Number: 0
 <1><1860>: Abbrev Number: 8 (DW_TAG_typedef)
    <1861>   DW_AT_name        : (indirect string, offset: 0xa21): uint8_t
    <1865>   DW_AT_decl_file   : 29
    <1866>   DW_AT_decl_line   : 48
    <1867>   DW_AT_type        : <0x145d>
 <1><186b>: Abbrev Number: 44 (DW_TAG_typedef)
    <186c>   DW_AT_name        : (indirect string, offset: 0x122a): UINT8
    <1870>   DW_AT_decl_file   : 30
    <1871>   DW_AT_decl_line   : 284
    <1873>   DW_AT_type        : <0x145d>
 <1><1877>: Abbrev Number: 44 (DW_TAG_typedef)
    <1878>   DW_AT_name        : (indirect string, offset: 0x5e3): UINT32
    <187c>   DW_AT_decl_file   : 30
    <187d>   DW_AT_decl_line   : 286
    <187f>   DW_AT_type        : <0xbee>
 <1><1883>: Abbrev Number: 44 (DW_TAG_typedef)
    <1884>   DW_AT_name        : (indirect string, offset: 0xe7): BOOL
    <1888>   DW_AT_decl_file   : 30
    <1889>   DW_AT_decl_line   : 287
    <188b>   DW_AT_type        : <0x1245>
 <1><188f>: Abbrev Number: 44 (DW_TAG_typedef)
    <1890>   DW_AT_name        : (indirect string, offset: 0xd60): BYTE
    <1894>   DW_AT_decl_file   : 30
    <1895>   DW_AT_decl_line   : 288
    <1897>   DW_AT_type        : <0x186b>
 <1><189b>: Abbrev Number: 44 (DW_TAG_typedef)
    <189c>   DW_AT_name        : (indirect string, offset: 0x11e9): CHAR
    <18a0>   DW_AT_decl_file   : 30
    <18a1>   DW_AT_decl_line   : 289
    <18a3>   DW_AT_type        : <0x186b>
 <1><18a7>: Abbrev Number: 44 (DW_TAG_typedef)
    <18a8>   DW_AT_name        : (indirect string, offset: 0x223): ULONG
    <18ac>   DW_AT_decl_file   : 30
    <18ad>   DW_AT_decl_line   : 294
    <18af>   DW_AT_type        : <0x1877>
 <1><18b3>: Abbrev Number: 44 (DW_TAG_typedef)
    <18b4>   DW_AT_name        : (indirect string, offset: 0x13d3): LPSTR
    <18b8>   DW_AT_decl_file   : 30
    <18b9>   DW_AT_decl_line   : 303
    <18bb>   DW_AT_type        : <0x18bf>
 <1><18bf>: Abbrev Number: 51 (DW_TAG_pointer_type)
    <18c0>   DW_AT_byte_size   : 8
    <18c1>   DW_AT_type        : <0x189b>
 <1><18c5>: Abbrev Number: 44 (DW_TAG_typedef)
    <18c6>   DW_AT_name        : (indirect string, offset: 0x29c): HANDLE
    <18ca>   DW_AT_decl_file   : 30
    <18cb>   DW_AT_decl_line   : 304
    <18cd>   DW_AT_type        : <0xbf5>
 <1><18d1>: Abbrev Number: 44 (DW_TAG_typedef)
    <18d2>   DW_AT_name        : (indirect string, offset: 0x299): DEVHANDLE
    <18d6>   DW_AT_decl_file   : 30
    <18d7>   DW_AT_decl_line   : 308
    <18d9>   DW_AT_type        : <0x18c5>
 <1><18dd>: Abbrev Number: 44 (DW_TAG_typedef)
    <18de>   DW_AT_name        : (indirect string, offset: 0xde4): HAPPLICATION
    <18e2>   DW_AT_decl_file   : 30
    <18e3>   DW_AT_decl_line   : 309
    <18e5>   DW_AT_type        : <0x18c5>
 <1><18e9>: Abbrev Number: 44 (DW_TAG_typedef)
    <18ea>   DW_AT_name        : (indirect string, offset: 0x104b): HCONTAINER
    <18ee>   DW_AT_decl_file   : 30
    <18ef>   DW_AT_decl_line   : 311
    <18f1>   DW_AT_type        : <0x18c5>
 <1><18f5>: Abbrev Number: 7 (DW_TAG_structure_type)
    <18f6>   DW_AT_name        : (indirect string, offset: 0xa6c): Struct_Version
    <18fa>   DW_AT_byte_size   : 2
    <18fb>   DW_AT_decl_file   : 31
    <18fc>   DW_AT_decl_line   : 26
    <18fd>   DW_AT_sibling     : <0x191a>
 <2><1901>: Abbrev Number: 39 (DW_TAG_member)
    <1902>   DW_AT_name        : (indirect string, offset: 0x19cc): major
    <1906>   DW_AT_decl_file   : 31
    <1907>   DW_AT_decl_line   : 27
    <1908>   DW_AT_type        : <0x188f>
    <190c>   DW_AT_data_member_location: 0
 <2><190d>: Abbrev Number: 39 (DW_TAG_member)
    <190e>   DW_AT_name        : (indirect string, offset: 0x385): minor
    <1912>   DW_AT_decl_file   : 31
    <1913>   DW_AT_decl_line   : 28
    <1914>   DW_AT_type        : <0x188f>
    <1918>   DW_AT_data_member_location: 1
 <2><1919>: Abbrev Number: 0
 <1><191a>: Abbrev Number: 8 (DW_TAG_typedef)
    <191b>   DW_AT_name        : (indirect string, offset: 0x7ef): VERSION
    <191f>   DW_AT_decl_file   : 31
    <1920>   DW_AT_decl_line   : 29
    <1921>   DW_AT_type        : <0x18f5>
 <1><1925>: Abbrev Number: 61 (DW_TAG_structure_type)
    <1926>   DW_AT_name        : (indirect string, offset: 0x19bd): Struct_DEVINFO
    <192a>   DW_AT_byte_size   : 294
    <192c>   DW_AT_decl_file   : 31
    <192d>   DW_AT_decl_line   : 31
    <192e>   DW_AT_sibling     : <0x19f3>
 <2><1932>: Abbrev Number: 39 (DW_TAG_member)
    <1933>   DW_AT_name        : (indirect string, offset: 0x7ab): Version
    <1937>   DW_AT_decl_file   : 31
    <1938>   DW_AT_decl_line   : 32
    <1939>   DW_AT_type        : <0x191a>
    <193d>   DW_AT_data_member_location: 0
 <2><193e>: Abbrev Number: 39 (DW_TAG_member)
    <193f>   DW_AT_name        : (indirect string, offset: 0x12aa): Manufacturer
    <1943>   DW_AT_decl_file   : 31
    <1944>   DW_AT_decl_line   : 33
    <1945>   DW_AT_type        : <0x19f3>
    <1949>   DW_AT_data_member_location: 2
 <2><194a>: Abbrev Number: 39 (DW_TAG_member)
    <194b>   DW_AT_name        : (indirect string, offset: 0x13d9): Issuer
    <194f>   DW_AT_decl_file   : 31
    <1950>   DW_AT_decl_line   : 34
    <1951>   DW_AT_type        : <0x19f3>
    <1955>   DW_AT_data_member_location: 66
 <2><1956>: Abbrev Number: 39 (DW_TAG_member)
    <1957>   DW_AT_name        : (indirect string, offset: 0x1163): Label
    <195b>   DW_AT_decl_file   : 31
    <195c>   DW_AT_decl_line   : 35
    <195d>   DW_AT_type        : <0x1a03>
    <1961>   DW_AT_data_member_location: 130
 <2><1962>: Abbrev Number: 39 (DW_TAG_member)
    <1963>   DW_AT_name        : (indirect string, offset: 0x1030): SerialNumber
    <1967>   DW_AT_decl_file   : 31
    <1968>   DW_AT_decl_line   : 36
    <1969>   DW_AT_type        : <0x1a03>
    <196d>   DW_AT_data_member_location: 162
 <2><196e>: Abbrev Number: 39 (DW_TAG_member)
    <196f>   DW_AT_name        : (indirect string, offset: 0x7a9): HWVersion
    <1973>   DW_AT_decl_file   : 31
    <1974>   DW_AT_decl_line   : 37
    <1975>   DW_AT_type        : <0x191a>
    <1979>   DW_AT_data_member_location: 194
 <2><197a>: Abbrev Number: 39 (DW_TAG_member)
    <197b>   DW_AT_name        : (indirect string, offset: 0xd8e): FirmwareVersion
    <197f>   DW_AT_decl_file   : 31
    <1980>   DW_AT_decl_line   : 38
    <1981>   DW_AT_type        : <0x191a>
    <1985>   DW_AT_data_member_location: 196
 <2><1986>: Abbrev Number: 39 (DW_TAG_member)
    <1987>   DW_AT_name        : (indirect string, offset: 0x2f2): AlgSymCap
    <198b>   DW_AT_decl_file   : 31
    <198c>   DW_AT_decl_line   : 39
    <198d>   DW_AT_type        : <0x18a7>
    <1991>   DW_AT_data_member_location: 198
 <2><1992>: Abbrev Number: 39 (DW_TAG_member)
    <1993>   DW_AT_name        : (indirect string, offset: 0x1528): AlgAsymCap
    <1997>   DW_AT_decl_file   : 31
    <1998>   DW_AT_decl_line   : 40
    <1999>   DW_AT_type        : <0x18a7>
    <199d>   DW_AT_data_member_location: 202
 <2><199e>: Abbrev Number: 39 (DW_TAG_member)
    <199f>   DW_AT_name        : (indirect string, offset: 0x8): AlgHashCap
    <19a3>   DW_AT_decl_file   : 31
    <19a4>   DW_AT_decl_line   : 41
    <19a5>   DW_AT_type        : <0x18a7>
    <19a9>   DW_AT_data_member_location: 206
 <2><19aa>: Abbrev Number: 39 (DW_TAG_member)
    <19ab>   DW_AT_name        : (indirect string, offset: 0x7db): DevAuthAlgId
    <19af>   DW_AT_decl_file   : 31
    <19b0>   DW_AT_decl_line   : 42
    <19b1>   DW_AT_type        : <0x18a7>
    <19b5>   DW_AT_data_member_location: 210
 <2><19b6>: Abbrev Number: 39 (DW_TAG_member)
    <19b7>   DW_AT_name        : (indirect string, offset: 0x1824): TotalSpace
    <19bb>   DW_AT_decl_file   : 31
    <19bc>   DW_AT_decl_line   : 43
    <19bd>   DW_AT_type        : <0x18a7>
    <19c1>   DW_AT_data_member_location: 214
 <2><19c2>: Abbrev Number: 39 (DW_TAG_member)
    <19c3>   DW_AT_name        : (indirect string, offset: 0x13e9): FreeSpace
    <19c7>   DW_AT_decl_file   : 31
    <19c8>   DW_AT_decl_line   : 44
    <19c9>   DW_AT_type        : <0x18a7>
    <19cd>   DW_AT_data_member_location: 218
 <2><19ce>: Abbrev Number: 39 (DW_TAG_member)
    <19cf>   DW_AT_name        : (indirect string, offset: 0x1720): MaxECCBufferSize
    <19d3>   DW_AT_decl_file   : 31
    <19d4>   DW_AT_decl_line   : 45
    <19d5>   DW_AT_type        : <0x18a7>
    <19d9>   DW_AT_data_member_location: 222
 <2><19da>: Abbrev Number: 39 (DW_TAG_member)
    <19db>   DW_AT_name        : (indirect string, offset: 0x839): MaxBufferSize
    <19df>   DW_AT_decl_file   : 31
    <19e0>   DW_AT_decl_line   : 46
    <19e1>   DW_AT_type        : <0x18a7>
    <19e5>   DW_AT_data_member_location: 226
 <2><19e6>: Abbrev Number: 39 (DW_TAG_member)
    <19e7>   DW_AT_name        : (indirect string, offset: 0x1c12): Reserved
    <19eb>   DW_AT_decl_file   : 31
    <19ec>   DW_AT_decl_line   : 47
    <19ed>   DW_AT_type        : <0x1a13>
    <19f1>   DW_AT_data_member_location: 230
 <2><19f2>: Abbrev Number: 0
 <1><19f3>: Abbrev Number: 48 (DW_TAG_array_type)
    <19f4>   DW_AT_type        : <0x189b>
    <19f8>   DW_AT_sibling     : <0x1a03>
 <2><19fc>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <19fd>   DW_AT_type        : <0xbaa>
    <1a01>   DW_AT_upper_bound : 63
 <2><1a02>: Abbrev Number: 0
 <1><1a03>: Abbrev Number: 48 (DW_TAG_array_type)
    <1a04>   DW_AT_type        : <0x189b>
    <1a08>   DW_AT_sibling     : <0x1a13>
 <2><1a0c>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <1a0d>   DW_AT_type        : <0xbaa>
    <1a11>   DW_AT_upper_bound : 31
 <2><1a12>: Abbrev Number: 0
 <1><1a13>: Abbrev Number: 48 (DW_TAG_array_type)
    <1a14>   DW_AT_type        : <0x188f>
    <1a18>   DW_AT_sibling     : <0x1a23>
 <2><1a1c>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <1a1d>   DW_AT_type        : <0xbaa>
    <1a21>   DW_AT_upper_bound : 63
 <2><1a22>: Abbrev Number: 0
 <1><1a23>: Abbrev Number: 8 (DW_TAG_typedef)
    <1a24>   DW_AT_name        : (indirect string, offset: 0x19c4): DEVINFO
    <1a28>   DW_AT_decl_file   : 31
    <1a29>   DW_AT_decl_line   : 48
    <1a2a>   DW_AT_type        : <0x1925>
 <1><1a2e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1a2f>   DW_AT_name        : (indirect string, offset: 0x1774): Struct_ECCPUBLICKEYBLOB
    <1a33>   DW_AT_byte_size   : 132
    <1a34>   DW_AT_decl_file   : 31
    <1a35>   DW_AT_decl_line   : 70
    <1a36>   DW_AT_sibling     : <0x1a5f>
 <2><1a3a>: Abbrev Number: 39 (DW_TAG_member)
    <1a3b>   DW_AT_name        : (indirect string, offset: 0x161e): BitLen
    <1a3f>   DW_AT_decl_file   : 31
    <1a40>   DW_AT_decl_line   : 71
    <1a41>   DW_AT_type        : <0x18a7>
    <1a45>   DW_AT_data_member_location: 0
 <2><1a46>: Abbrev Number: 39 (DW_TAG_member)
    <1a47>   DW_AT_name        : (indirect string, offset: 0xf31): XCoordinate
    <1a4b>   DW_AT_decl_file   : 31
    <1a4c>   DW_AT_decl_line   : 72
    <1a4d>   DW_AT_type        : <0x1a13>
    <1a51>   DW_AT_data_member_location: 4
 <2><1a52>: Abbrev Number: 39 (DW_TAG_member)
    <1a53>   DW_AT_name        : (indirect string, offset: 0x919): YCoordinate
    <1a57>   DW_AT_decl_file   : 31
    <1a58>   DW_AT_decl_line   : 73
    <1a59>   DW_AT_type        : <0x1a13>
    <1a5d>   DW_AT_data_member_location: 68
 <2><1a5e>: Abbrev Number: 0
 <1><1a5f>: Abbrev Number: 8 (DW_TAG_typedef)
    <1a60>   DW_AT_name        : (indirect string, offset: 0x177b): ECCPUBLICKEYBLOB
    <1a64>   DW_AT_decl_file   : 31
    <1a65>   DW_AT_decl_line   : 74
    <1a66>   DW_AT_type        : <0x1a2e>
 <1><1a6a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1a6b>   DW_AT_name        : (indirect string, offset: 0x1069): Struct_ECCSIGNATUREBLOB
    <1a6f>   DW_AT_byte_size   : 128
    <1a70>   DW_AT_decl_file   : 31
    <1a71>   DW_AT_decl_line   : 89
    <1a72>   DW_AT_sibling     : <0x1a8b>
 <2><1a76>: Abbrev Number: 62 (DW_TAG_member)
    <1a77>   DW_AT_name        : r
    <1a79>   DW_AT_decl_file   : 31
    <1a7a>   DW_AT_decl_line   : 90
    <1a7b>   DW_AT_type        : <0x1a13>
    <1a7f>   DW_AT_data_member_location: 0
 <2><1a80>: Abbrev Number: 62 (DW_TAG_member)
    <1a81>   DW_AT_name        : s
    <1a83>   DW_AT_decl_file   : 31
    <1a84>   DW_AT_decl_line   : 91
    <1a85>   DW_AT_type        : <0x1a13>
    <1a89>   DW_AT_data_member_location: 64
 <2><1a8a>: Abbrev Number: 0
 <1><1a8b>: Abbrev Number: 8 (DW_TAG_typedef)
    <1a8c>   DW_AT_name        : (indirect string, offset: 0xe97): ECCSIGNATUREBLOB
    <1a90>   DW_AT_decl_file   : 31
    <1a91>   DW_AT_decl_line   : 92
    <1a92>   DW_AT_type        : <0x1a6a>
 <1><1a96>: Abbrev Number: 48 (DW_TAG_array_type)
    <1a97>   DW_AT_type        : <0x1860>
    <1a9b>   DW_AT_sibling     : <0x1aa6>
 <2><1a9f>: Abbrev Number: 49 (DW_TAG_subrange_type)
    <1aa0>   DW_AT_type        : <0xbaa>
    <1aa4>   DW_AT_upper_bound : 31
 <2><1aa5>: Abbrev Number: 0
