LibvirtError.38=\u7cfb\u7edf\u8c03\u7528\u5931\u8d25(\u9519\u8bef\u7801\u4e3a\uff1a38)\u3002
LibvirtError.42=\u8be5\u865a\u62df\u673a\u5728\u7269\u7406\u4e3b\u673a\u4e0a\u4e0d\u5b58\u5728\u3002
LibvirtError.49=\u8be5\u5b58\u50a8\u6c60\u5728\u7269\u7406\u4e3b\u673a\u4e0a\u4e0d\u5b58\u5728\u3002
LibvirtError.50=\u5b58\u50a8\u5377\u4e0d\u5b58\u5728\u3002
LibvirtError.55=\u865a\u62df\u673a\u672a\u5904\u4e8e\u8fd0\u884c\u72b6\u6001\u3002
LibvirtError.2000=\u8fde\u63a5\u4e3b\u673a\u201c{0}\u201d\u5931\u8d25\u3002
LibvirtError.2001=\u4e3b\u673a\u5f02\u5e38\u6216\u8005\u6b63\u5728\u5904\u7406\u5176\u5b83\u4e8b\u52a1\uff0c\u8bf7\u7a0d\u5019\u91cd\u8bd5\u3002
LibvirtError.2002=\u6d3b\u52a8\u7684\u5b58\u50a8\u6c60\u6b63\u5728\u88ab\u865a\u62df\u673a\u4f7f\u7528\uff0c\u4e0d\u5141\u8bb8\u5220\u9664\u3002\u8bf7\u5148\u6682\u505c\u5b58\u50a8\u6c60\uff0c\u7136\u540e\u8fdb\u884c\u5220\u9664\u64cd\u4f5c\u3002
LibvirtError.2003=\u5b58\u50a8\u6c60\u76ee\u6807\u8def\u5f84\u5df2\u7ecf\u88ab\u5176\u5b83\u5b58\u50a8\u6c60\u4f7f\u7528\uff0c\u8bf7\u66f4\u6362\u76ee\u6807\u8def\u5f84\u3002
LibvirtError.2004=\u76ee\u6807\u5b58\u50a8\u6c60\u8def\u5f84\u4e0d\u5b58\u5728\u3002
LibvirtError.2005=\u540c\u540d\u7684\u5377\u6216\u76ee\u5f55\u5df2\u5b58\u5728\u3002
LibvirtError.2006=\u5b58\u50a8\u6c60\u6e90\u8def\u5f84\u5df2\u7ecf\u88ab\u5176\u5b83\u5b58\u50a8\u6c60\u4f7f\u7528\uff0c\u8bf7\u66f4\u6362\u6e90\u8def\u5f84\u3002
LibvirtError.2007=\u7cfb\u7edf\u6267\u884ctools\u547d\u4ee4\u5931\u8d25\u3002
LibvirtError.2100=\u5b58\u50a8\u6c60\u4f7f\u7528\u7684\u6587\u4ef6\u670d\u52a1\u5668\u5f02\u5e38\uff0c\u8bf7\u68c0\u67e5\u6587\u4ef6\u670d\u52a1\u5668\u914d\u7f6e\u6216\u901a\u4fe1\u7f51\u7edc\u3002
LibvirtError.3001=\u865a\u62df\u673a\u201c{0}\u201d\u5df2\u5b58\u5728\u3002
LibvirtError.3002=\u865a\u62df\u673a\u201c{0}\u201d\u4e0d\u5b58\u5728\u3002
LibvirtError.3003=\u865a\u62df\u673a\u53ea\u652f\u6301\u4e00\u4e2a\u663e\u5361\u3002
LibvirtError.3004=\u865a\u62df\u673a\u6700\u591a\u53ea\u652f\u63014\u4e2aIDE\u5b58\u50a8\u3002
LibvirtError.3005=\u865a\u62df\u673a\u6700\u591a\u53ea\u652f\u63012\u4e2a\u8f6f\u76d8\u3002
LibvirtError.3006=\u5f85\u589e\u52a0\u7684\u786c\u4ef6\u5df2\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u91cd\u590d\u589e\u52a0\u3002
LibvirtError.3007=\u865a\u62df\u673a\u53ea\u652f\u6301\u4e00\u4e2a\u63a7\u5236\u53f0\u3002
LibvirtError.3008=\u865a\u62df\u673a\u6700\u591a\u53ea\u652f\u63014\u4e2a\u4e32\u53e3\u3002
LibvirtError.3009=\u4e32\u53e3\u53f7\u201c{0}\u201d\u5df2\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u91cd\u590d\u589e\u52a0\u3002
LibvirtError.3010=\u865a\u62df\u673a\u5df2\u5904\u4e8e\u5173\u95ed\u72b6\u6001\u3002
LibvirtError.3011=\u865a\u62df\u673a\u5df2\u5904\u4e8e\u8fd0\u884c\u72b6\u6001\u3002
LibvirtError.3012=\u589e\u52a0\u786c\u4ef6\u9519\u8bef\u3002
LibvirtError.3013=\u865a\u62df\u673a\u5df2\u5904\u4e8e\u6682\u505c\u72b6\u6001\u3002
LibvirtError.3014=\u865a\u62df\u673a\u672a\u5904\u4e8e\u6682\u505c\u72b6\u6001\u3002
LibvirtError.3015=\u865a\u62df\u673a\u6a21\u677f\u201c{0}\u201d\u4e0d\u5b58\u5728\u3002
LibvirtError.3016=\u5bf9\u4e8e\u5904\u4e8e\u8fd0\u884c\u72b6\u6001\u7684\u865a\u62df\u673a\uff0c\u4fee\u6539\u540e\u7684CPU\u603b\u6838\u6570\u4e0d\u80fd\u5c0f\u4e8e\u865a\u62df\u673a\u5f53\u524d\u7684CPU\u603b\u6838\u6570\u3002
LibvirtError.3017=\u865a\u62df\u673a\u6700\u591a\u53ea\u652f\u63015\u4e2a\u663e\u5361\u3002
LibvirtError.3018=\u865a\u62df\u673a\u81f3\u5c11\u67091\u4e2a\u663e\u5361\u3002
LibvirtError.3101=\u8be5\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u78c1\u76d8\u4e0d\u652f\u6301\u5feb\u7167\uff0c\u4ec5\u667a\u80fd\u683c\u5f0f\u7684\u6587\u4ef6\u6216RBD\u5757\u4f5c\u4e3a\u865a\u62df\u673a\u78c1\u76d8\u65f6\uff0c\u624d\u652f\u6301\u5feb\u7167\u3002
LibvirtError.3102=\u8be5\u865a\u62df\u673a\u5904\u4e8e\u4f11\u7720\u72b6\u6001\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002\u8bf7\u5148\u6b63\u5e38\u5173\u95ed\u865a\u62df\u673a\uff0c\u518d\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3103=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u5728\u7ebf\u8fc1\u79fb\u3002
LibvirtError.3104=\u8be5\u865a\u62df\u673a\u5b58\u5728\u672c\u5730\u88f8\u78c1\u76d8\u3001LVM\u3001iSCSI\u6216FC\u5757\u8bbe\u5907\u7c7b\u578b\u78c1\u76d8\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u3002
LibvirtError.3105=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002\u8bf7\u4f7f\u7528\u8fc1\u79fb\u4e3b\u673a\u53ca\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3106=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u8be5\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u865a\u62df\u4ea4\u6362\u673a\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3107=\u540c\u540d\u7684\u865a\u62df\u673a\u5feb\u7167\u5df2\u5b58\u5728\uff0c\u8bf7\u8f93\u5165\u5176\u5b83\u7684\u540d\u79f0\u3002
LibvirtError.3108=\u76ee\u7684\u4e3b\u673a\u4e2d\u865a\u62df\u4ea4\u6362\u673a\u201c{0}\u201d\u4e0e\u8be5\u865a\u62df\u673a\u4e0d\u517c\u5bb9\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3109=\u76ee\u6807\u6570\u636e\u5b58\u50a8\u5df2\u5b58\u5728\u88ab\u5176\u5b83\u865a\u62df\u673a\u4f7f\u7528\u7684\u5b58\u50a8\u5377\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u6570\u636e\u5b58\u50a8\u6216\u8005\u66f4\u6539\u4e3b\u673a\u548c\u6570\u636e\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3110=\u76ee\u6807\u6570\u636e\u5b58\u50a8\u4e2d\u5df2\u5b58\u5728\u5b58\u50a8\u5377\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u3002
LibvirtError.3111=\u865a\u62df\u673a\u5df2\u6302\u8f7d\u5149\u9a71\u4fe1\u606f\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3112=\u865a\u62df\u673a\u5df2\u6302\u8f7d\u8f6f\u9a71\u4fe1\u606f\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3113=\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u5149\u9a71\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3114=\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u8f6f\u9a71\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3115=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u76f8\u5e94\u7684\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3116=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u5149\u9a71\u76f8\u5e94\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u3002
LibvirtError.3117=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u8f6f\u9a71\u76f8\u5e94\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u3002
LibvirtError.3118=\u76ee\u7684\u4e3b\u673a\u76f8\u5e94\u7684\u5b58\u50a8\u6c60\u5904\u4e8e\u4e0d\u6d3b\u52a8\u72b6\u6001\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3119=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u76f8\u5e94\u7684\u5171\u4eab\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3120=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u8be5\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u865a\u62df\u4ea4\u6362\u673a\u201c{0}\u201d\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u514b\u9686\u3002
LibvirtError.3121=\u6e90\u4e3b\u673a\u4e0e\u76ee\u7684\u4e3b\u673a\u4e3a\u540c\u4e00\u53f0\u4e3b\u673a\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3122=\u865a\u62df\u673a\u5df2\u6302\u8f7dUSB\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3123=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u7684\u57fa\u7840\u5b58\u50a8\u6587\u4ef6\u201c{0}\u201d\u4fdd\u5b58\u5728\u672c\u5730\u5b58\u50a8\u4e2d\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u4e3b\u673a\u6216\u8005\u66f4\u6539\u4e3b\u673a\u548c\u6570\u636e\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3124=\u9ad8\u901f\u683c\u5f0f\u7684\u78c1\u76d8\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u6570\u636e\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u5728\u7ebf\u8fc1\u79fb\u3002
LibvirtError.3125=\u8be5\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u5b58\u50a8\u5377\u201c{0}\u201d\u6216\u8005\u5b58\u50a8\u5377\u201c{1}\u201d\u6240\u5728\u7684\u5b58\u50a8\u6c60\u4e0d\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3126=\u8be5\u865a\u62df\u673a\u57fa\u7840\u955c\u50cf\u201c{0}\u201d\u6240\u5728\u7684\u5b58\u50a8\u6c60\u5728\u76ee\u7684\u4e3b\u673a\u4e0a\u4e0d\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3127=\u8be5\u865a\u62df\u673a\u57fa\u7840\u955c\u50cf\u201c{0}\u201d\u5728\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3128=\u76ee\u7684\u4e3b\u673a\u4e2d\u865a\u62df\u4ea4\u6362\u673a\u201c{0}\u201d\u4e0e\u8be5\u865a\u62df\u673a\u4e0d\u517c\u5bb9\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u514b\u9686\u3002
LibvirtError.3129=\u865a\u62df\u673a\u5df2\u6302\u8f7dPCI\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3130=\u8be5\u865a\u62df\u673a\u672a\u6302\u8f7d\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u521b\u5efa\u5feb\u7167\u3002
LibvirtError.3131=\u865a\u62df\u673a\u6302\u8f7dUSB\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3132=\u865a\u62df\u673a\u6302\u8f7dPCI\u8bbe\u5907\u3001\u865a\u62df\u52a0\u5bc6\u5361\u8bbe\u5907\u6216\u8005GPU/vGPU\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3133=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u7684\u57fa\u7840\u5b58\u50a8\u6587\u4ef6\u201c{0}\u201d\u4fdd\u5b58\u5728\u672c\u5730\u5b58\u50a8\u4e2d\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u4e3b\u673a\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3134=\u8be5\u865a\u62df\u673a\u57fa\u7840\u955c\u50cf\u201c{0}\u201d\u6240\u5728\u7684\u5b58\u50a8\u6c60\u548c\u76ee\u7684\u4e3b\u673a\u76f8\u5e94\u7684\u5b58\u50a8\u6c60\u4e0d\u662f\u540c\u4e00\u5171\u4eab\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u4e3b\u673a\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3135=\u8be5\u865a\u62df\u673a\u57fa\u7840\u955c\u50cf\u201c{0}\u201d\u4e0d\u5b58\u5728\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3136=\u8be5\u865a\u62df\u673a\u5b58\u50a8\u5377\u201c{0}\u201d\u6240\u5728\u7684\u5b58\u50a8\u6c60\u548c\u76ee\u7684\u4e3b\u673a\u76f8\u5e94\u7684\u5b58\u50a8\u6c60\u662f\u540c\u4e00\u5171\u4eab\u5b58\u50a8\u6c60\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u4e3b\u673a\u548c\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3137=\u4e3b\u673a\u201c{0}\u201d\u7684\u5b58\u50a8\u6c60\u201c{1}\u201d\u5904\u4e8e\u4e0d\u6d3b\u52a8\u72b6\u6001\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u5b58\u50a8\u5377\u3002
LibvirtError.3138=\u4f7f\u7528\u8fc1\u79fb\u4e3b\u673a\u53ca\u5b58\u50a8\u65b9\u5f0f\u8fdb\u884c\u8fc1\u79fb\u65f6\uff0c\u5fc5\u987b\u8fc1\u79fb\u865a\u62df\u673a\u7684\u672c\u5730\u5b58\u50a8\u3002
LibvirtError.3170=\u865a\u62df\u673a\u914d\u7f6e\u975eUSB\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3171=\u865a\u62df\u673a\u914d\u7f6e\u975eUSB\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u5feb\u7167\u5185\u5b58\u64cd\u4f5c\u3002
LibvirtError.3172=\u865a\u62df\u673a\u914d\u7f6ePCI\u8bbe\u5907\u6216\u8005GPU\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u5feb\u7167\u5185\u5b58\u64cd\u4f5c\u3002
LibvirtError.3173=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u8fc1\u79fb\u3002
LibvirtError.3174=\u76ee\u7684\u4e3b\u673a\u5b58\u50a8\u7f51\u7edc\u5f02\u5e38\uff0c\u4e0d\u5141\u8bb8\u8fc1\u79fb\u865a\u62df\u673a\u3002
LibvirtError.3175=\u8be5\u865a\u62df\u673a\u672a\u6302\u8f7d\u201c{0}\u201d\u78c1\u76d8\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u521b\u5efa\u78c1\u76d8\u5feb\u7167\u3002
LibvirtError.3201=\u5b58\u50a8\u5377\u201c{0}\u201d\u4e0d\u5b58\u5728\u3002
LibvirtError.3202=\u865a\u62df\u673a\u78c1\u76d8\u201c{0}\u201d\u4e3a\u9ad8\u901f\u683c\u5f0f\u7684\u6587\u4ef6\uff0c\u4e0d\u5141\u8bb8\u5728\u7ebf\u514b\u9686\u3002\u4ec5\u667a\u80fd\u683c\u5f0f\u7684\u6587\u4ef6\u6216RBD\u5757\u4f5c\u4e3a\u865a\u62df\u673a\u78c1\u76d8\u65f6\uff0c\u624d\u652f\u6301\u5728\u7ebf\u514b\u9686\u3002\u8bf7\u4ee5\u79bb\u7ebf\u65b9\u5f0f\u514b\u9686\u6216\u8005\u5c06\u5176\u683c\u5f0f\u4fee\u6539\u4e3a\u667a\u80fd\u683c\u5f0f\u540e\uff0c\u518d\u8fdb\u884c\u5728\u7ebf\u514b\u9686\u3002
LibvirtError.3250=\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u78c1\u76d8\u4e3a\u9ad8\u901f\u683c\u5f0f\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u5728\u7ebf\u4e91\u7206\u53d1\u64cd\u4f5c\u3002
LibvirtError.3251=\u865a\u62df\u673a\u5df2\u6302\u8f7d\u5149\u9a71\u4fe1\u606f\uff0c\u4e0d\u5141\u8bb8\u4e91\u7206\u53d1\u5230\u5916\u90e8CIC\u3002
LibvirtError.3252=\u865a\u62df\u673a\u5df2\u6302\u8f7d\u8f6f\u9a71\u4fe1\u606f\uff0c\u4e0d\u5141\u8bb8\u4e91\u7206\u53d1\u5230\u5916\u90e8CIC\u3002
LibvirtError.3253=\u865a\u62df\u673a\u5df2\u4f7f\u7528\u5757\u8bbe\u5907\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u4e91\u7206\u53d1\u5230\u5916\u90e8CIC\u3002
LibvirtError.3254=\u865a\u62df\u673a\u5df2\u4f7f\u7528USB\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u4e91\u7206\u53d1\u5230\u5916\u90e8CIC\u3002
LibvirtError.3255=\u865a\u62df\u673a\u5df2\u4f7f\u7528PCI\u8bbe\u5907\u6216\u8005GPU\u8bbe\u5907\uff0c\u4e0d\u5141\u8bb8\u4e91\u7206\u53d1\u5230\u5916\u90e8CIC\u3002
LibvirtError.3256=\u865a\u62df\u673a\u4f7f\u7528\u4e86\u76f4\u901a\u7f51\u7edc\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3257=\u865a\u62df\u673a\u7ed1\u5b9a\u4e86NUMA\u8282\u70b9\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3258=\u865a\u62df\u673a\u7ed1\u5b9a\u4e86NUMA\u8282\u70b9\uff0c\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u8be5NUMA\u8282\u70b9\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3259=\u865a\u62df\u673a\u7ed1\u5b9a\u4e86NUMA\u8282\u70b9\uff0c\u76ee\u7684\u4e3b\u673a\u4e0e\u6e90\u4e3b\u673a\u4e0aNUMA\u8282\u70b9\u7ed1\u5b9a\u7684CPU\u6838\u6570\u4e0d\u4e00\u81f4\uff0c\u4e0d\u5141\u8bb8\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.3301=\u8be5\u865a\u62df\u673a\u5b58\u5728LVM\u3001iSCSI\u3001\u672c\u5730\u78c1\u76d8\u6216FC\u5757\u8bbe\u5907\u7c7b\u578b\u7684\u78c1\u76d8\uff0c\u4e0d\u5141\u8bb8\u8fdb\u884c\u514b\u9686\u6216\u8005\u8f6c\u6362\u6210\u865a\u62df\u673a\u6a21\u677f\u3002
LibvirtError.3302=\u8be5\u865a\u62df\u673a\u5b58\u5728\u9ad8\u901f\u683c\u5f0f\u7684\u6587\u4ef6\u7c7b\u578b\u78c1\u76d8\uff0c\u6216\u8005LVM\u3001iSCSI\u3001\u3001\u672c\u5730\u78c1\u76d8\u3001FC\u5757\u8bbe\u5907\u7c7b\u578b\u7684\u78c1\u76d8\uff0c\u4e0d\u5141\u8bb8\u5728\u7ebf\u514b\u9686\u865a\u62df\u673a\u6a21\u677f\u3002
LibvirtError.3401=\u76ee\u7684\u4e3b\u673a\u4e0d\u5b58\u5728\u8be5\u865a\u62df\u673a\u4f7f\u7528\u7684\u865a\u62df\u4ea4\u6362\u673a\uff0c\u4e0d\u5141\u8bb8\u90e8\u7f72\u3002
LibvirtError.3801=\u7f51\u7edc\u8fc7\u6ee4\u7b56\u7565\u201c{0}\u201d\u5df2\u5b58\u5728\u3002
LibvirtError.3901=\u78c1\u76d8\u5df2\u5305\u542b\u5feb\u7167\uff0c\u4e0d\u5141\u8bb8\u4fee\u6539\u78c1\u76d8\u683c\u5f0f\u53ca\u5bb9\u91cf\u3002
LibvirtError.3902=\u8be5\u865a\u62df\u673a\u6240\u4f7f\u7528\u7684\u78c1\u76d8\u5305\u542b\u5feb\u7167\uff0c\u78c1\u76d8\u683c\u5f0f\u4e0d\u5141\u8bb8\u4fee\u6539\u4e3a\u9ad8\u901f\u3002
LibvirtError.3903=\u78c1\u76d8\u5df2\u5305\u542b\u57fa\u7840\u955c\u50cf\uff0c\u4e0d\u5141\u8bb8\u4fee\u6539\u78c1\u76d8\u683c\u5f0f\u53ca\u5bb9\u91cf\u3002
LibvirtError.3904=\u8be5\u865a\u62df\u673a\u4f7f\u7528\u672c\u5730\u5b58\u50a8\uff0c\u4e0d\u5141\u8bb8\u4ee5\u66f4\u6539\u4e3b\u673a\u7684\u65b9\u5f0f\u8fdb\u884c\u865a\u62df\u673a\u8fc1\u79fb\u3002
LibvirtError.3999=\u865a\u62df\u673a\u201c{0}\u201d\u5728\u7ebf\u5220\u9664Virtio\u78c1\u76d8\u201c{1}\u201d\u5931\u8d25\u3002
LibvirtError.10000=\u64cd\u4f5c\u6267\u884c\u5931\u8d25\uff0c\u8bf7\u67e5\u770bVMware\u4e2d\u76f8\u5173\u7684\u64cd\u4f5c\u65e5\u5fd7\u3002
LibvirtError.10002=VMware\u5de5\u5177\u672a\u6b63\u5e38\u8fd0\u884c\uff0c\u65e0\u6cd5\u6267\u884c\u8be5\u64cd\u4f5c\u3002
LibvirtError.10003=VMware\u865a\u62df\u673a\u4e0d\u652f\u6301\u5feb\u7167\u64cd\u4f5c\u3002
LibvirtError.10004=\u4e3b\u673a\u4e0e\u5206\u5e03\u5f0f\u5b58\u50a8\u95f4\u7684\u5b58\u50a8\u7f51\u7edc\u8fde\u63a5\u9519\u8bef\uff0c\u8bf7\u5148\u6062\u590d\u7f51\u7edc\u8fde\u63a5\u3002